in	-0
<unk>	0
<s>	0
</s>	0
;\	-1
▁=	-2
int	-3
▁i	-4
on	-5
▁s	-6
▁(	-7
{\	-8
);\	-9
}\	-10
or	-11
re	-12
▁l	-13
▁{\	-14
ut	-15
▁n	-16
an	-17
▁<	-18
▁1	-19
▁c	-20
st	-21
()	-22
\"	-23
▁f	-24
▁0	-25
▁+	-26
▁m	-27
▁}\	-28
)\	-29
er	-30
ong	-31
▁int	-32
▁a	-33
▁p	-34
▁if	-35
se	-36
▁-	-37
\'	-38
++	-39
▁re	-40
▁for	-41
ge	-42
:\	-43
ur	-44
en	-45
▁t	-46
▁long	-47
▁b	-48
nt	-49
ol	-50
▁j	-51
][	-52
urn	-53
turn	-54
it	-55
▁>	-56
de	-57
▁in	-58
ti	-59
rint	-60
le	-61
▁st	-62
▁d	-63
ing	-64
mp	-65
el	-66
];\	-67
▁return	-68
▁==	-69
▁r	-70
put	-71
▁v	-72
out	-73
▁ma	-74
ans	-75
▁x	-76
ar	-77
uti	-78
▁<<	-79
▁sol	-80
00	-81
++)	-82
▁*	-83
();\	-84
ad	-85
ua	-86
ang	-87
▁,	-88
ub	-89
ac	-90
ex	-91
am	-92
uage	-93
anguage	-94
▁language	-95
ution	-96
▁&	-97
▁"	-98
▁solution	-99
else	-100
St	-101
id	-102
▁0;\	-103
at	-104
um	-105
ort	-106
ew	-107
▁2	-108
▁\	-109
ext	-110
(\"	-111
al	-112
▁0;	-113
▁\"	-114
ring	-115
▁ans	-116
▁>>	-117
us	-118
li	-119
].	-120
sp	-121
▁\'	-122
nint	-123
▁k	-124
hi	-125
):\	-126
▁<=	-127
for	-128
▁w	-129
Int	-130
▁else	-131
cl	-132
print	-133
ma	-134
iz	-135
mport	-136
end	-137
▁print	-138
ue	-139
▁P	-140
can	-141
],	-142
▁new	-143
])	-144
▁+=	-145
ow	-146
▁y	-147
-1	-148
>\	-149
con	-150
long	-151
em	-152
ine	-153
\2	-154
String	-155
ni	-156
ir	-157
lic	-158
▁%	-159
ublic	-160
hile	-161
input	-162
std	-163
next	-164
▁main	-165
=0	-166
as	-167
▁C	-168
clu	-169
ange	-170
ct	-171
clude	-172
include	-173
av	-174
oid	-175
[]	-176
▁cin	-177
--	-178
▁1;	-179
▁cout	-180
ame	-181
▁1;\	-182
ava	-183
[0	-184
▁java	-185
[1	-186
▁S	-187
▁range	-188
\",	-189
▁/	-190
ch	-191
yst	-192
ace	-193
ystem	-194
ati	-195
().	-196
ize	-197
eg	-198
ve	-199
os	-200
▁std	-201
▁M	-202
ou	-203
1,	-204
def	-205
ce	-206
ader	-207
tif	-208
▁1)	-209
▁while	-210
atic	-211
())\	-212
ok	-213
▁ar	-214
▁!	-215
▁&&	-216
ap	-217
▁I	-218
Re	-219
ON	-220
nimport	-221
▁"#	-222
using	-223
TH	-224
tint	-225
lit	-226
▁PY	-227
THON	-228
▁PYTHON	-229
nusing	-230
PP	-231
io	-232
▁CPP	-233
(\"%	-234
ff	-235
tion	-236
split	-237
Reader	-238
▁name	-239
ll	-240
ream	-241
0000	-242
())	-243
ri	-244
tfor	-245
space	-246
()\	-247
ist	-248
od	-249
▁e	-250
▁namespace	-251
\\	-252
=1	-253
▁++	-254
bit	-255
+1	-256
ack	-257
size	-258
▁q	-259
▁static	-260
++;\	-261
▁T	-262
oub	-263
]\	-264
ner	-265
ouble	-266
oken	-267
]);\	-268
ctor	-269
op	-270
▁!=	-271
▁g	-272
))	-273
ount	-274
▁}	-275
bits	-276
ot	-277
++.	-278
stdc	-279
▁res	-280
▁max	-281
ush	-282
canner	-283
ate	-284
public	-285
len	-286
ass	-287
tre	-288
▁1,	-289
ra	-290
is	-291
(0	-292
▁0)	-293
▁u	-294
▁th	-295
//	-296
uff	-297
Ex	-298
System	-299
cep	-300
const	-301
▁void	-302
▁N	-303
th	-304
\3	-305
ception	-306
Exception	-307
▁A	-308
irst	-309
max	-310
▁input	-311
nfor	-312
▁h	-313
▁B	-314
));\	-315
ln	-316
emp	-317
▁{	-318
]=	-319
get	-320
▁dp	-321
ak	-322
nextInt	-323
){\	-324
());\	-325
▁>=	-326
ool	-327
▁|	-328
println	-329
▁ch	-330
▁String	-331
Token	-332
rit	-333
▁-1	-334
push	-335
Stream	-336
read	-337
back	-338
▁next	-339
ed	-340
▁sum	-341
air	-342
▁public	-343
▁min	-344
▁end	-345
cond	-346
nconst	-347
nput	-348
reak	-349
eger	-350
canf	-351
▁:	-352
[0]	-353
rue	-354
new	-355
alse	-356
);	-357
▁0,	-358
▁cl	-359
++)\	-360
ig	-361
ys	-362
util	-363
line	-364
Integer	-365
treturn	-366
first	-367
map	-368
and	-369
void	-370
▁1\	-371
app	-372
char	-373
▁con	-374
▁cnt	-375
\34	-376
om	-377
▁3	-378
ode	-379
),	-380
ere	-381
[2	-382
▁class	-383
row	-384
VA	-385
▁1]	-386
▁_	-387
▁scanf	-388
second	-389
\");\	-390
▁||	-391
OException	-392
par	-393
▁endl	-394
▁J	-395
append	-396
::	-397
izer	-398
▁out	-399
nvoid	-400
▁break	-401
ts	-402
=0;	-403
▁ve	-404
▁sc	-405
▁JA	-406
▁JAVA	-407
10	-408
(\'	-409
nc	-410
ered	-411
uffered	-412
▁F	-413
str	-414
▁num	-415
▁L	-416
riter	-417
ast	-418
gs	-419
min	-420
▁arr	-421
▁mod	-422
\')	-423
▁0\	-424
nprint	-425
tc	-426
▁printf	-427
==	-428
();	-429
▁len	-430
ase	-431
▁and	-432
parse	-433
import	-434
rra	-435
ul	-436
ufferedReader	-437
tin	-438
▁throw	-439
\20	-440
ath	-441
es	-442
))\	-443
tpublic	-444
][0	-445
num	-446
Writer	-447
▁sel	-448
nputStream	-449
▁self	-450
nlong	-451
])\	-452
▁vector	-453
vector	-454
▁System	-455
<<	-456
il	-457
▁double	-458
Line	-459
\";\	-460
▁Scanner	-461
▁args	-462
(),	-463
ab	-464
fs	-465
gth	-466
arr	-467
npublic	-468
▁10	-469
((	-470
nd	-471
▁o	-472
▁throws	-473
pair	-474
yp	-475
if	-476
▁cur	-477
la	-478
▁1);\	-479
while	-480
.*	-481
ns	-482
▁-=	-483
ndef	-484
et	-485
>>	-486
▁[	-487
▁true	-488
dp	-489
tinue	-490
][1	-491
.*;\	-492
Scanner	-493
define	-494
++){\	-495
▁read	-496
me	-497
set	-498
▁map	-499
Tokenizer	-500
▁mid	-501
▁((	-502
▁solve	-503
▁(!	-504
sum	-505
length	-506
(0);\	-507
▁get	-508
ind	-509
2,	-510
**	-511
▁//	-512
AX	-513
egin	-514
##	-515
\")\	-516
string	-517
▁count	-518
Long	-519
nif	-520
=1\	-521
rintWriter	-522
ith	-523
▁str	-524
▁bool	-525
val	-526
fr	-527
<=	-528
cur	-529
▁z	-530
begin	-531
count	-532
]]	-533
▁val	-534
▁ad	-535
cnt	-536
}"	-537
\')\	-538
▁IOException	-539
__	-540
▁continue	-541
res	-542
3\20	-543
▁R	-544
▁4	-545
▁list	-546
▁false	-547
tr	-548
lag	-549
NO	-550
ain	-551
+=	-552
ck	-553
ft	-554
pos	-555
\';\	-556
nb	-557
(1,	-558
▁D	-559
▁BufferedReader	-560
▁Integer	-561
rray	-562
tie	-563
list	-564
ES	-565
to	-566
▁5	-567
▁dfs	-568
▁de	-569
tb	-570
\343\20	-571
stdio	-572
▁pri	-573
000	-574
OD	-575
--;\	-576
ht	-577
▁?	-578
[1]	-579
add	-580
YES	-581
ver	-582
▁sys	-583
▁tmp	-584
▁pos	-585
)"	-586
readLine	-587
dex	-588
List	-589
▁is	-590
vate	-591
ost	-592
(1	-593
▁2;\	-594
telse	-595
▁it	-596
----	-597
▁the	-598
est	-599
oint	-600
ke	-601
▁10000	-602
empl	-603
};\	-604
==0	-605
▁\'0	-606
uffer	-607
tp	-608
ult	-609
sy	-610
LL	-611
--)	-612
parseInt	-613
()))\	-614
ull	-615
[]\	-616
▁(1	-617
▁StringTokenizer	-618
▁char	-619
tSystem	-620
1[	-621
▁1][	-622
nputStreamReader	-623
▁#	-624
▁or	-625
twhile	-626
▁string	-627
lo	-628
with	-629
(0,	-630
][0]	-631
0,	-632
=0\	-633
▁import	-634
elif	-635
▁PrintWriter	-636
2)	-637
▁sort	-638
MAX	-639
from	-640
▁br	-641
ert	-642
2[	-643
sync	-644
).	-645
▁to	-646
ile	-647
▁ret	-648
tst	-649
-1]	-650
▁pre	-651
▁op	-652
nn	-653
uto	-654
emplate	-655
▁temp	-656
Ch	-657
ean	-658
▁ll	-659
▁0:\	-660
lf	-661
tprint	-662
ype	-663
nin	-664
▁MOD	-665
▁-1;\	-666
art	-667
ro	-668
▁id	-669
7;\	-670
buffer	-671
ber	-672
▁Main	-673
uil	-674
]==	-675
1\2	-676
cd	-677
nextToken	-678
atch	-679
sort	-680
▁ios	-681
\',	-682
▁size	-683
▁2)	-684
ose	-685
▁se	-686
class	-687
ta	-688
Char	-689
IOException	-690
2;\	-691
nvector	-692
▁di	-693
=0;\	-694
ntemplate	-695
ree	-696
+=1\	-697
of	-698
nbool	-699
ninline	-700
▁tr	-701
[3	-702
readline	-703
->	-704
ore	-705
nelse	-706
▁flag	-707
dge	-708
omp	-709
▁add	-710
\"\	-711
na	-712
▁col	-713
NF	-714
ator	-715
▁pair	-716
▁G	-717
false	-718
di	-719
tlong	-720
ower	-721
tt	-722
▁null	-723
ord	-724
▁2;	-725
one	-726
▁vis	-727
act	-728
pop	-729
▁1];\	-730
stdin	-731
sc	-732
rrayList	-733
=1;	-734
que	-735
up	-736
▁Fast	-737
xt	-738
*(	-739
tString	-740
uild	-741
▁private	-742
mod	-743
ight	-744
▁nextInt	-745
▁tot	-746
▁mem	-747
stream	-748
ty	-749
▁100000000	-750
▁up	-751
his	-752
eck	-753
▁Input	-754
At	-755
da	-756
node	-757
▁9	-758
maxn	-759
self	-760
Double	-761
▁le	-762
1.	-763
tstatic	-764
te	-765
20	-766
2\2	-767
writ	-768
▁E	-769
now	-770
▁boolean	-771
double	-772
sert	-773
vis	-774
rt	-775
lem	-776
():\	-777
charAt	-778
][1]	-779
close	-780
has	-781
base	-782
▁[]\	-783
▁\'\\	-784
(){\	-785
putStream	-786
erator	-787
rent	-788
▁ab	-789
un	-790
▁H	-791
▁const	-792
▁elif	-793
okenizer	-794
im	-795
able	-796
!=	-797
64	-798
####	-799
▁gcd	-800
▁Math	-801
▁mx	-802
uer	-803
Out	-804
tans	-805
uf	-806
auto	-807
%2	-808
\343\201\2	-809
▁node	-810
ound	-811
ent	-812
▁__	-813
ign	-814
▁^	-815
5\2	-816
??	-817
abs	-818
index	-819
pre	-820
rrays	-821
5];\	-822
ata	-823
\'\	-824
[10000	-825
uct	-826
▁0)\	-827
-1,	-828
ime	-829
▁not	-830
ename	-831
InputStream	-832
ypename	-833
2.	-834
▁def	-835
][2	-836
]++;\	-837
];	-838
▁ex	-839
lld	-840
▁he	-841
▁-1,	-842
1)	-843
uery	-844
sed	-845
▁set	-846
ction	-847
▁INF	-848
(2	-849
\':\	-850
amb	-851
BufferedReader	-852
▁catch	-853
tmp	-854
ash	-855
▁now	-856
50	-857
▁6	-858
\27	-859
ypedef	-860
idx	-861
nfrom	-862
]:\	-863
ambda	-864
▁put	-865
1;\	-866
sk	-867
▁*=	-868
ray	-869
he	-870
▁of	-871
▁first	-872
..	-873
ntypedef	-874
▁Long	-875
left	-876
▁dist	-877
ion	-878
▁0);\	-879
▁--	-880
▁1)\	-881
▁\'0\'	-882
)(	-883
fl	-884
▁abs	-885
▁sizeof	-886
)]\	-887
return	-888
2\	-889
mid	-890
br	-891
nstr	-892
--------	-893
>0	-894
▁\"\\	-895
>=	-896
▁ra	-897
rip	-898
11	-899
tout	-900
▁memset	-901
>();\	-902
insert	-903
-1)	-904
▁getchar	-905
▁True	-906
▁2,	-907
ove	-908
▁;	-909
▁line	-910
nstruct	-911
▁last	-912
raw	-913
)):\	-914
▁ArrayList	-915
▁mp	-916
write	-917
]-	-918
More	-919
per	-920
▁math	-921
▁V	-922
fi	-923
==1	-924
0;\	-925
24	-926
▁;\	-927
[4	-928
▁try	-929
olve	-930
▁K	-931
hasMore	-932
nwhile	-933
tcin	-934
▁-1)	-935
▁result	-936
ctions	-937
top	-938
▁fr	-939
igned	-940
parseLong	-941
oin	-942
()]\	-943
=(	-944
▁sz	-945
▁rep	-946
&&	-947
nl	-948
mx	-949
strip	-950
+1,	-951
▁InputReader	-952
temp	-953
date	-954
▁raw	-955
3,	-956
ep	-957
▁adj	-958
Array	-959
inal	-960
ii	-961
flag	-962
+\"	-963
▁\";\	-964
▁gr	-965
▁%=	-966
cle	-967
▁edge	-968
▁1:\	-969
▁Q	-970
value	-971
nsigned	-972
▁\");\	-973
▁7	-974
(-1	-975
tScanner	-976
lections	-977
math	-978
▁nextLong	-979
▁check	-980
typename	-981
+1)	-982
▁find	-983
▁left	-984
ax	-985
▁MAX	-986
uilder	-987
main	-988
cin	-989
ls	-990
wap	-991
Math	-992
endl	-993
tcout	-994
▁10;\	-995
ght	-996
2);\	-997
Arrays	-998
nans	-999
Builder	-1000
MAXN	-1001
53	-1002
Set	-1003
/\	-1004
▁X	-1005
Stack	-1006
find	-1007
td	-1008
name	-1009
No	-1010
OutputStream	-1011
[10	-1012
make	-1013
wer	-1014
▁1])	-1015
tpri	-1016
▁start	-1017
nx	-1018
col	-1019
▁os	-1020
[0][	-1021
▁lo	-1022
){	-1023
▁right	-1024
iostream	-1025
ents	-1026
PrintWriter	-1027
▁/=	-1028
tot	-1029
▁as	-1030
6\2	-1031
verse	-1032
▁tokenizer	-1033
▁inf	-1034
=1;\	-1035
▁7;\	-1036
▁this	-1037
[5	-1038
[2]	-1039
▁fi	-1040
▁operator	-1041
▁idx	-1042
err	-1043
nclass	-1044
ULL	-1045
▁par	-1046
pow	-1047
IO	-1048
▁cost	-1049
});\	-1050
mat	-1051
Map	-1052
ask	-1053
tprivate	-1054
▁8	-1055
empty	-1056
right	-1057
pp	-1058
tn	-1059
99	-1060
▁query	-1061
////	-1062
ces	-1063
2)\	-1064
tbreak	-1065
Tr	-1066
range	-1067
si	-1068
[(	-1069
ard	-1070
▁cal	-1071
▁lambda	-1072
Tokens	-1073
]==\'	-1074
▁second	-1075
▁tree	-1076
▁number	-1077
▁pr	-1078
join	-1079
...	-1080
****	-1081
▁hi	-1082
]+	-1083
▁1].	-1084
ation	-1085
(!	-1086
yte	-1087
▁puts	-1088
[][	-1089
start	-1090
▁test	-1091
sub	-1092
▁False	-1093
▁scan	-1094
ven	-1095
qrt	-1096
▁dis	-1097
hasMoreTokens	-1098
=[]\	-1099
ter	-1100
▁ro	-1101
ont	-1102
,\	-1103
.0	-1104
▁que	-1105
Yes	-1106
\345\2	-1107
▁\'9	-1108
Of	-1109
▁\",	-1110
ited	-1111
Trace	-1112
StackTrace	-1113
tx	-1114
({	-1115
▁reader	-1116
▁\'-	-1117
printStackTrace	-1118
ld	-1119
▁fa	-1120
;}\	-1121
edge	-1122
all	-1123
▁swap	-1124
flush	-1125
nm	-1126
▁100	-1127
igit	-1128
▁ok	-1129
1];\	-1130
2(	-1131
▁comp	-1132
NULL	-1133
aph	-1134
IN	-1135
▁\'.	-1136
())):\	-1137
▁:\	-1138
ity	-1139
=[	-1140
true	-1141
43	-1142
▁pw	-1143
low	-1144
▁index	-1145
ps	-1146
▁Double	-1147
▁file	-1148
2;	-1149
qua	-1150
//\	-1151
▁stdin	-1152
nchar	-1153
▁mat	-1154
▁vec	-1155
▁final	-1156
==0:\	-1157
5],	-1158
▁1000000007;\	-1159
\');\	-1160
=\"	-1161
tf	-1162
>(	-1163
▁W	-1164
\")	-1165
▁update	-1166
pl	-1167
▁Exception	-1168
▁total	-1169
gr	-1170
▁StringBuilder	-1171
▁make	-1172
ect	-1173
ise	-1174
In	-1175
+1\	-1176
time	-1177
odd	-1178
parseDouble	-1179
▁2\	-1180
pace	-1181
stdout	-1182
▁point	-1183
(0)\	-1184
np	-1185
solve	-1186
100	-1187
▁inv	-1188
ey	-1189
arent	-1190
▁maxn	-1191
root	-1192
9;\	-1193
(*	-1194
unc	-1195
▁*/\	-1196
[][]	-1197
▁2);\	-1198
5;\	-1199
14	-1200
+1):\	-1201
gh	-1202
▁FastScanner	-1203
\343\202\2	-1204
!=0	-1205
+1]	-1206
▁init	-1207
nstring	-1208
34	-1209
rime	-1210
▁)	-1211
nextLong	-1212
▁mn	-1213
dist	-1214
ek	-1215
tl	-1216
tm	-1217
00010	-1218
rem	-1219
▁nextDouble	-1220
▁sb	-1221
▁all	-1222
▁on	-1223
▁go	-1224
3\2	-1225
▁U	-1226
▁(0	-1227
▁pow	-1228
▁fact	-1229
▁from	-1230
erase	-1231
\":\	-1232
cost	-1233
clear	-1234
▁FastReader	-1235
▁collections	-1236
▁1))	-1237
[1][	-1238
▁ind	-1239
queue	-1240
[0])	-1241
▁mul	-1242
ink	-1243
<>();\	-1244
▁dep	-1245
are	-1246
▁curr	-1247
-1):\	-1248
1);\	-1249
▁1],	-1250
########	-1251
▁ss	-1252
Num	-1253
▁array	-1254
try	-1255
60	-1256
ug	-1257
[100	-1258
():	-1259
[++	-1260
▁{}\	-1261
sys	-1262
ptr	-1263
1=	-1264
front	-1265
32	-1266
▁\'0\';\	-1267
18	-1268
7\2	-1269
._	-1270
bj	-1271
▁\'1	-1272
):	-1273
▁Y	-1274
▁"\	-1275
????	-1276
ay	-1277
[0]\	-1278
▁ac	-1279
▁prev	-1280
Point	-1281
▁seg	-1282
▁value	-1283
▁en	-1284
([	-1285
tain	-1286
tres	-1287
00000	-1288
ic	-1289
▁root	-1290
<<\"	-1291
[0].	-1292
\',\'	-1293
bound	-1294
)%	-1295
[0],	-1296
▁at	-1297
igInteger	-1298
▁dx	-1299
lements	-1300
ret	-1301
▁File	-1302
56	-1303
▁nxt	-1304
our	-1305
▁top	-1306
▁data	-1307
-1;	-1308
array	-1309
▁ne	-1310
isect	-1311
▁99	-1312
pr	-1313
fa	-1314
▁used	-1315
▁dy	-1316
==\'	-1317
ArrayList	-1318
ip	-1319
▁an	-1320
tbool	-1321
▁com	-1322
▁xrange	-1323
-2	-1324
▁(;	-1325
+1)\	-1326
(2,	-1327
▁calc	-1328
rob	-1329
Space	-1330
\",&	-1331
lower	-1332
buf	-1333
▁answer	-1334
ne	-1335
-1]\	-1336
▁diff	-1337
=0,	-1338
tdouble	-1339
)/	-1340
+(	-1341
▁1]);\	-1342
last	-1343
]){\	-1344
fd	-1345
EP	-1346
ero	-1347
txt	-1348
-1;\	-1349
▁Point	-1350
());	-1351
ss	-1352
824	-1353
▁3)	-1354
=\'	-1355
[:	-1356
▁time	-1357
cout	-1358
StringTokenizer	-1359
lines	-1360
ers	-1361
13	-1362
]))	-1363
82443	-1364
check	-1365
},	-1366
▁Task	-1367
▁exit	-1368
loat	-1369
-1][	-1370
tree	-1371
▁build	-1372
▁1000	-1373
gor	-1374
▁Hash	-1375
sz	-1376
))"	-1377
1\	-1378
number	-1379
▁bit	-1380
▁low	-1381
-1\	-1382
wo	-1383
comp	-1384
dict	-1385
To	-1386
▁be	-1387
)))\	-1388
▁sp	-1389
key	-1390
tscanf	-1391
[0];\	-1392
ithm	-1393
▁cmp	-1394
\346\2	-1395
gorithm	-1396
nelif	-1397
26	-1398
▁pl	-1399
8244353	-1400
rix	-1401
1(	-1402
toString	-1403
FS	-1404
▁*\	-1405
2*	-1406
tains	-1407
]));\	-1408
▁row	-1409
▁scanner	-1410
ZE	-1411
inf	-1412
]];\	-1413
Max	-1414
▁buf	-1415
rag	-1416
init	-1417
▁push	-1418
algorithm	-1419
▁20	-1420
ble	-1421
▁5;\	-1422
++]	-1423
]].	-1424
code	-1425
4,	-1426
]*	-1427
▁auto	-1428
(\"\\	-1429
▁prime	-1430
lim	-1431
▁26	-1432
)));\	-1433
hild	-1434
----------------	-1435
▁head	-1436
▁[]	-1437
)*	-1438
rr	-1439
▁\"\";\	-1440
digit	-1441
▁@	-1442
15	-1443
oth	-1444
nk	-1445
▁[0]	-1446
▁sub	-1447
SpaceChar	-1448
data	-1449
▁nextLine	-1450
mask	-1451
Count	-1452
▁1000000007	-1453
▁1));\	-1454
tokenizer	-1455
used	-1456
2=	-1457
▁can	-1458
00000000	-1459
▁rem	-1460
▁>>=	-1461
ttry	-1462
]))\	-1463
▁base	-1464
)]	-1465
own	-1466
IZE	-1467
mn	-1468
throw	-1469
ors	-1470
||	-1471
▁bisect	-1472
▁\'-\')	-1473
▁solver	-1474
curr	-1475
nll	-1476
ny	-1477
2:\	-1478
+1][	-1479
▁pi	-1480
\320	-1481
lang	-1482
(10	-1483
▁stream	-1484
▁one	-1485
12	-1486
result	-1487
continue	-1488
▁lc	-1489
▁cerr	-1490
▁power	-1491
▁1):\	-1492
\",\"	-1493
prag	-1494
pragma	-1495
+1);\	-1496
match	-1497
tBufferedReader	-1498
▁sh	-1499
▁ord	-1500
)-	-1501
tdp	-1502
True	-1503
**\	-1504
▁IO	-1505
zy	-1506
]),	-1507
▁(0);	-1508
▁sorted	-1509
-=	-1510
-=1\	-1511
red	-1512
▁3;	-1513
point	-1514
ndouble	-1515
INF	-1516
dis	-1517
\':	-1518
resize	-1519
▁best	-1520
5,	-1521
ach	-1522
\"\"	-1523
▁lst	-1524
tim	-1525
▁visited	-1526
bin	-1527
1][	-1528
tboolean	-1529
ite	-1530
▁fl	-1531
(1);\	-1532
▁Arrays	-1533
▁998244353	-1534
seek	-1535
[20000	-1536
writable	-1537
ec	-1538
bject	-1539
2]	-1540
ault	-1541
Val	-1542
▁mi	-1543
--)\	-1544
ostream	-1545
▁case	-1546
tsum	-1547
nxt	-1548
Node	-1549
tprintf	-1550
▁do	-1551
word	-1552
sible	-1553
▁\"+	-1554
1)\	-1555
1;	-1556
▁la	-1557
27	-1558
no	-1559
▁O	-1560
Output	-1561
▁heap	-1562
(\"0	-1563
▁-1);\	-1564
1]	-1565
\")"	-1566
▁1);	-1567
type	-1568
ance	-1569
lambda	-1570
▁\')\	-1571
\'0	-1572
▁\'9\')	-1573
▁^=	-1574
▁3;\	-1575
▁2]	-1576
(\"-1	-1577
[0])\	-1578
▁graph	-1579
fact	-1580
req	-1581
57	-1582
vec	-1583
▁fac	-1584
age	-1585
▁-1\	-1586
ial	-1587
test	-1588
quals	-1589
com	-1590
/2	-1591
[]=	-1592
ools	-1593
]!=	-1594
▁GC	-1595
ority	-1596
+1;\	-1597
▁2)\	-1598
▁by	-1599
▁**	-1600
;++	-1601
▁tt	-1602
+1];\	-1603
dep	-1604
cc	-1605
adj	-1606
-1)\	-1607
MOD	-1608
roblem	-1609
▁MAXN	-1610
ninput	-1611
gcd	-1612
LU	-1613
[100000	-1614
====	-1615
▁run	-1616
▁cc	-1617
(\"\");\	-1618
/**\	-1619
[0][0]	-1620
hor	-1621
0)	-1622
==0)	-1623
Col	-1624
gn	-1625
tcount	-1626
////////	-1627
nextLine	-1628
AA	-1629
sqrt	-1630
47	-1631
▁{0,	-1632
Tree	-1633
][3	-1634
ated	-1635
▁inp	-1636
▁bo	-1637
diff	-1638
▁sm	-1639
erge	-1640
3;\	-1641
▁sqrt	-1642
▁key	-1643
null	-1644
-(	-1645
rk	-1646
<(	-1647
Hash	-1648
)+	-1649
[-1]	-1650
]][	-1651
▁OutputStream	-1652
▁are	-1653
▁mask	-1654
▁Output	-1655
ly	-1656
64_	-1657
\']	-1658
\'.	-1659
exit	-1660
tes	-1661
▁4;	-1662
▁1),	-1663
1\20	-1664
▁del	-1665
Time	-1666
nr	-1667
▁arg	-1668
andom	-1669
▁li	-1670
▁aa	-1671
▁si	-1672
cstdio	-1673
vi	-1674
ank	-1675
vel	-1676
▁xx	-1677
▁has	-1678
File	-1679
(-1)\	-1680
ary	-1681
remove	-1682
▁(2	-1683
Sum	-1684
10];\	-1685
(3	-1686
.\	-1687
▁odd	-1688
▁Node	-1689
********	-1690
▁reverse	-1691
ment	-1692
[])	-1693
▁Ru	-1694
dx	-1695
contains	-1696
dd	-1697
OR	-1698
\30	-1699
Number	-1700
trep	-1701
equals	-1702
mes	-1703
▁current	-1704
Mis	-1705
[1])	-1706
tk	-1707
Next	-1708
LUE	-1709
▁my	-1710
▁al	-1711
▁ii	-1712
VALUE	-1713
]--;\	-1714
,0,	-1715
tchar	-1716
gist	-1717
▁word	-1718
,&	-1719
2):\	-1720
ave	-1721
Chars	-1722
qu	-1723
inv	-1724
gister	-1725
[3]	-1726
nmap	-1727
▁parent	-1728
▁co	-1729
▁bin	-1730
aultdict	-1731
ell	-1732
Byte	-1733
limit	-1734
uthor	-1735
newlines	-1736
]>	-1737
▁unsigned	-1738
ng	-1739
▁eps	-1740
<<(	-1741
▁byte	-1742
▁REP	-1743
Input	-1744
[0]);\	-1745
[1])\	-1746
▁putchar	-1747
current	-1748
]])	-1749
reverse	-1750
bug	-1751
▁edges	-1752
(0),	-1753
ition	-1754
nf	-1755
▁that	-1756
open	-1757
CharArray	-1758
][0],	-1759
2];\	-1760
▁high	-1761
other	-1762
▁ta	-1763
3\	-1764
prev	-1765
(-1);\	-1766
ER	-1767
▁rt	-1768
For	-1769
Edge	-1770
sh	-1771
▁2:\	-1772
ork	-1773
▁wh	-1774
ntime	-1775
iterator	-1776
▁queue	-1777
[1].	-1778
olution	-1779
stack	-1780
args	-1781
1],	-1782
▁ptr	-1783
tw	-1784
▁);\	-1785
toCharArray	-1786
bo	-1787
▁typename	-1788
bool	-1789
ux	-1790
▁per	-1791
▁|=	-1792
Mismatch	-1793
▁GCC	-1794
BigInteger	-1795
aa	-1796
upper	-1797
cal	-1798
▁lower	-1799
)1	-1800
][2]	-1801
[1],	-1802
▁neg	-1803
▁(1);	-1804
▁=\	-1805
npair	-1806
▁mark	-1807
[-1	-1808
isSpaceChar	-1809
7,	-1810
ear	-1811
)){\	-1812
\347\2	-1813
==1:\	-1814
place	-1815
case	-1816
▁nums	-1817
\"\"\"\	-1818
ueue	-1819
query	-1820
▁IN	-1821
▁lim	-1822
fill	-1823
9,	-1824
(\"1	-1825
>&	-1826
tStringTokenizer	-1827
0;	-1828
ncount	-1829
▁Pair	-1830
opy	-1831
0\	-1832
output	-1833
▁pq	-1834
\342\2	-1835
ill	-1836
▁)\	-1837
lement	-1838
\';	-1839
xx	-1840
lock	-1841
));	-1842
▁0){\	-1843
▁counter	-1844
/*	-1845
▁≤	-1846
nT	-1847
prime	-1848
ceil	-1849
44	-1850
arget	-1851
(1)\	-1852
]]++;\	-1853
tvoid	-1854
++,	-1855
tarr	-1856
eight	-1857
▁InputStream	-1858
go	-1859
▁&&\	-1860
<0	-1861
37	-1862
Index	-1863
lst	-1864
▁pp	-1865
oll	-1866
inp	-1867
sion	-1868
▁no	-1869
-1);\	-1870
>;\	-1871
]==0	-1872
▁output	-1873
▁0.	-1874
[\'	-1875
unction	-1876
>,	-1877
ytes	-1878
tPrintWriter	-1879
ompar	-1880
[20	-1881
▁None	-1882
▁color	-1883
▁Count	-1884
mi	-1885
Pos	-1886
[1]);\	-1887
▁\'0\')	-1888
visited	-1889
▁pro	-1890
PS	-1891
total	-1892
emplace	-1893
nums	-1894
▁io	-1895
▁length	-1896
scanf	-1897
▁ni	-1898
tv	-1899
rstrip	-1900
Base	-1901
▁stack	-1902
▁step	-1903
__(	-1904
▁\';\	-1905
\'){\	-1906
[1]\	-1907
▁even	-1908
this	-1909
tll	-1910
▁change	-1911
rc	-1912
reader	-1913
nA	-1914
cis	-1915
16	-1916
sb	-1917
ays	-1918
*2	-1919
asc	-1920
3)	-1921
//2	-1922
mul	-1923
▁writ	-1924
-8	-1925
[6	-1926
4\27	-1927
▁md	-1928
▁inputStream	-1929
fix	-1930
+1;	-1931
substring	-1932
▁two	-1933
Pair	-1934
ry	-1935
▁imp	-1936
author	-1937
▁\34	-1938
▁+\	-1939
▁yy	-1940
▁path	-1941
▁Runtime	-1942
▁ed	-1943
file	-1944
seg	-1945
isdigit	-1946
][0];\	-1947
▁Buffered	-1948
sorted	-1949
1:\	-1950
cision	-1951
▁Max	-1952
▁bl	-1953
▁defaultdict	-1954
(\"%.	-1955
[4]	-1956
▁deque	-1957
tArrays	-1958
lay	-1959
*-	-1960
%2==0	-1961
inputStream	-1962
[2][	-1963
▁optim	-1964
ations	-1965
▁Mod	-1966
ascii	-1967
▁LL	-1968
]==1	-1969
()){\	-1970
0);\	-1971
ater	-1972
▁outputStream	-1973
▁div	-1974
ark	-1975
tvector	-1976
▁move	-1977
lis	-1978
▁\"0	-1979
throws	-1980
▁merge	-1981
()"	-1982
▁HashMap	-1983
▁\"\"	-1984
tthis	-1985
▁998244353;\	-1986
▁EPS	-1987
▁The	-1988
ertools	-1989
nst	-1990
▁PI	-1991
▁};\	-1992
\')"	-1993
▁\")\	-1994
▁writer	-1995
▁rec	-1996
ies	-1997
tcnt	-1998
precision	-1999
outputStream	-2000
▁nx	-2001
][2];\	-2002
Elements	-2003
ca	-2004
▁integer	-2005
rapp	-2006
▁need	-2007
tbr	-2008
▁stdout	-2009
tcontinue	-2010
unsigned	-2011
)))	-2012
▁Counter	-2013
▁open	-2014
Min	-2015
ha	-2016
()))	-2017
uple	-2018
Queue	-2019
dfs	-2020
46	-2021
>0:\	-2022
valueOf	-2023
hs	-2024
uck	-2025
hasMoreElements	-2026
item	-2027
▁lazy	-2028
imum	-2029
tmax	-2030
▁strlen	-2031
00010];\	-2032
replace	-2033
rapper	-2034
ock	-2035
▁(((	-2036
[1];\	-2037
qr	-2038
parent	-2039
[200	-2040
su	-2041
eld	-2042
erate	-2043
▁acos	-2044
__\':\	-2045
▁{1,	-2046
▁sgn	-2047
▁InputMismatch	-2048
ST	-2049
▁cy	-2050
False	-2051
17	-2052
Object	-2053
################	-2054
[1000	-2055
\343\201\256	-2056
[1:	-2057
Wrapper	-2058
▁-1)\	-2059
igh	-2060
▁\".	-2061
00\2	-2062
▁BigInteger	-2063
▁List	-2064
run	-2065
\350	-2066
//2\	-2067
>::	-2068
▁ls	-2069
ual	-2070
▁IOWrapper	-2071
FSIZE	-2072
▁My	-2073
>=0	-2074
\343\203\2	-2075
telif	-2076
19	-2077
▁sy	-2078
UFSIZE	-2079
ytesIO	-2080
imal	-2081
mpty	-2082
▁\'__	-2083
\344\27	-2084
▁Re	-2085
sm	-2086
▁grid	-2087
▁fast	-2088
-1];\	-2089
riority	-2090
head	-2091
▁compare	-2092
▁48	-2093
▁using	-2094
[100005];\	-2095
▁bb	-2096
oss	-2097
printf	-2098
(2*	-2099
cr	-2100
▁itertools	-2101
ilter	-2102
2][	-2103
▁deg	-2104
fac	-2105
(0)	-2106
18;\	-2107
substr	-2108
register	-2109
stat	-2110
▁ps	-2111
]<	-2112
5)	-2113
Di	-2114
\320\27	-2115
40	-2116
--){\	-2117
ant	-2118
deg	-2119
▁maxi	-2120
▁-*-	-2121
▁sa	-2122
\'\'	-2123
umerate	-2124
nv	-2125
[::	-2126
▁code	-2127
????????	-2128
▁optimize	-2129
narr	-2130
▁py	-2131
33	-2132
not	-2133
▁2];\	-2134
▁rr	-2135
▁su	-2136
▁pref	-2137
9+	-2138
25\2	-2139
▁debug	-2140
py	-2141
loor	-2142
▁FastIO	-2143
▁26;	-2144
Not	-2145
acter	-2146
neg	-2147
++];\	-2148
oup	-2149
Key	-2150
▁ce	-2151
▁fix	-2152
▁\"1	-2153
▁me	-2154
ai	-2155
▁upd	-2156
▁\'#	-2157
ify	-2158
Value	-2159
order	-2160
▁enumerate	-2161
▁qu	-2162
-1])	-2163
float	-2164
▁cr	-2165
▁Tree	-2166
(_	-2167
);}\	-2168
inked	-2169
child	-2170
[8	-2171
break	-2172
▁heapq	-2173
co	-2174
lex	-2175
0.	-2176
\35	-2177
▁3,	-2178
▁mo	-2179
▁type	-2180
30	-2181
pri	-2182
IT	-2183
▁ny	-2184
ake	-2185
▁ct	-2186
▁exp	-2187
▁item	-2188
▁implements	-2189
LE	-2190
isE	-2191
▁depth	-2192
▁2*	-2193
old	-2194
▁memo	-2195
son	-2196
tri	-2197
Len	-2198
▁readByte	-2199
]+=	-2200
▁rev	-2201
▁2),	-2202
]%	-2203
();}\	-2204
____	-2205
▁dir	-2206
25	-2207
▁bfs	-2208
\302\2	-2209
32_	-2210
▁matrix	-2211
▁ge	-2212
6,	-2213
▁write	-2214
▁assert	-2215
97	-2216
▁vi	-2217
elper	-2218
tF	-2219
▁\\	-2220
▁Num	-2221
▁hash	-2222
(-	-2223
▁tim	-2224
(\'0	-2225
[0]*	-2226
tmin	-2227
▁pt	-2228
▁un	-2229
▁uni	-2230
Prime	-2231
etter	-2232
+2	-2233
cmath	-2234
IM	-2235
bl	-2236
▁Edge	-2237
inkedList	-2238
rd	-2239
-1:\	-2240
rev	-2241
▁with	-2242
▁zero	-2243
▁score	-2244
thon	-2245
▁0):\	-2246
tq	-2247
▁Compar	-2248
0};\	-2249
tj	-2250
500	-2251
cess	-2252
\"));\	-2253
De	-2254
▁tp	-2255
6];\	-2256
▁Solution	-2257
▁lcm	-2258
graph	-2259
tg	-2260
mple	-2261
\":	-2262
▁\'?	-2263
Arr	-2264
(0);	-2265
+=(	-2266
color	-2267
log	-2268
forces	-2269
▁fill	-2270
__\":\	-2271
▁primes	-2272
Le	-2273
reater	-2274
▁work	-2275
nset	-2276
▁1.0	-2277
[2];\	-2278
52	-2279
▁dd	-2280
▁float	-2281
▁\'.\')	-2282
Found	-2283
]],	-2284
68	-2285
5\	-2286
cy	-2287
▁vv	-2288
▁target	-2289
arch	-2290
pppp	-2291
▁In	-2292
tnew	-2293
1+	-2294
ded	-2295
[],	-2296
▁other	-2297
▁HashSet	-2298
ud	-2299
▁Ans	-2300
zero	-2301
▁0};\	-2302
nw	-2303
▁[0	-2304
ends	-2305
▁BytesIO	-2306
high	-2307
▁siz	-2308
#\	-2309
▁readInt	-2310
%2==0:\	-2311
]):\	-2312
Ans	-2313
▁gi	-2314
-1])\	-2315
▁(*	-2316
nres	-2317
\320\2	-2318
▁mini	-2319
arg	-2320
best	-2321
▁log	-2322
▁ceil	-2323
mark	-2324
][1];\	-2325
dered	-2326
▁Th	-2327
fstat	-2328
▁\'0\');\	-2329
Collections	-2330
▁inter	-2331
5][	-2332
OF	-2333
▁points	-2334
ence	-2335
▁\'*	-2336
▁\"__	-2337
▁pb	-2338
▁10;	-2339
▁testNumber	-2340
reopen	-2341
(\"-1\");\	-2342
▁CH	-2343
tcur	-2344
)==	-2345
ome	-2346
cstring	-2347
▁5,	-2348
▁cap	-2349
UT	-2350
answer	-2351
uni	-2352
▁dec	-2353
▁||\	-2354
▁ns	-2355
▁tc	-2356
▁upper	-2357
AC	-2358
fn	-2359
▁ext	-2360
▁INT	-2361
orial	-2362
1-	-2363
9999	-2364
▁){\	-2365
tpw	-2366
AR	-2367
ctual	-2368
2-	-2369
▁10)	-2370
(\'\\	-2371
\'):\	-2372
1000	-2373
down	-2374
Format	-2375
▁4)	-2376
mut	-2377
isEmpty	-2378
▁4;\	-2379
23	-2380
▁nd	-2381
scan	-2382
][1],	-2383
▁you	-2384
SE	-2385
even	-2386
First	-2387
▁Ar	-2388
decode	-2389
(4	-2390
mode	-2391
▁aux	-2392
000000	-2393
10],	-2394
▁FileReader	-2395
!=0:\	-2396
▁nl	-2397
▁tm	-2398
▁18	-2399
▁po	-2400
7\	-2401
NotFound	-2402
mem	-2403
28	-2404
▁freq	-2405
Over	-2406
▁fin	-2407
tnum	-2408
▁fixed	-2409
▁buffer	-2410
\"))\	-2411
10;\	-2412
>=0;	-2413
▁->	-2414
otal	-2415
ron	-2416
hite	-2417
1):\	-2418
eve	-2419
58	-2420
▁\'+	-2421
HashMap	-2422
cap	-2423
(){	-2424
pt	-2425
eam	-2426
values	-2427
update	-2428
▁"//	-2429
▁ri	-2430
Case	-2431
▁nn	-2432
▁each	-2433
\32	-2434
▁inline	-2435
57\27	-2436
sa	-2437
▁\3	-2438
dy	-2439
ride	-2440
5\20	-2441
▁Reader	-2442
dir	-2443
▁digit	-2444
path	-2445
3[	-2446
yy	-2447
Se	-2448
1++;\	-2449
▁Number	-2450
nsys	-2451
-->0	-2452
vert	-2453
▁numbers	-2454
▁pa	-2455
3;	-2456
tstring	-2457
48	-2458
▁mm	-2459
▁we	-2460
());}\	-2461
[50	-2462
ute	-2463
nB	-2464
▁big	-2465
▁MyScanner	-2466
▁tl	-2467
▁0));\	-2468
▁child	-2469
),\	-2470
▁ver	-2471
00010],	-2472
uilt	-2473
\350\2	-2474
,1,	-2475
action	-2476
ackage	-2477
▁16	-2478
\'0\'	-2479
▁-1};\	-2480
--,	-2481
ick	-2482
ump	-2483
nullptr	-2484
rep	-2485
flow	-2486
heap	-2487
========	-2488
Override	-2489
AAAA	-2490
oding	-2491
=2;	-2492
tArrayList	-2493
nq	-2494
▁ty	-2495
ren	-2496
▁sx	-2497
▁found	-2498
▁inc	-2499
▁good	-2500
▁maxx	-2501
ix	-2502
*=	-2503
▁10**	-2504
5;	-2505
jk	-2506
▁St	-2507
10\	-2508
compare	-2509
nmax	-2510
tsb	-2511
ag	-2512
▁down	-2513
tsolve	-2514
////////////////	-2515
▁plug	-2516
.0);\	-2517
▁nodes	-2518
\"<<	-2519
tsort	-2520
▁pii	-2521
format	-2522
/2;\	-2523
]==\"	-2524
▁Actual	-2525
(((	-2526
]=(	-2527
▁dif	-2528
▁Built	-2529
ODO	-2530
()),	-2531
▁table	-2532
▁CHelper	-2533
utf	-2534
▁order	-2535
▁kk	-2536
MIN	-2537
00];\	-2538
▁flow	-2539
step	-2540
nN	-2541
▁1])\	-2542
▁qr	-2543
00;\	-2544
tell	-2545
tStringBuilder	-2546
\",\	-2547
IOBase	-2548
ust	-2549
▁\'1\')	-2550
▁setprecision	-2551
(\	-2552
ess	-2553
▁have	-2554
Mod	-2555
▁\"<<	-2556
▁el	-2557
(\"0\");\	-2558
▁3\	-2559
==0):\	-2560
▁BufferedWriter	-2561
be	-2562
lc	-2563
▁fun	-2564
bal	-2565
]]);\	-2566
▁var	-2567
riorityQueue	-2568
▁chk	-2569
][1])	-2570
we	-2571
numChars	-2572
orm	-2573
po	-2574
score	-2575
ards	-2576
-1-	-2577
nostream	-2578
)),	-2579
()):\	-2580
▁fs	-2581
\'\'\'\	-2582
Code	-2583
▁state	-2584
angle	-2585
AB	-2586
tR	-2587
sizeof	-2588
tthrow	-2589
▁DP	-2590
][0])	-2591
edges	-2592
cursion	-2593
nh	-2594
▁nextToken	-2595
tdfs	-2596
day	-2597
▁\"-1	-2598
ive	-2599
[7	-2600
▁(-	-2601
\".	-2602
▁minus	-2603
function	-2604
10000	-2605
▁BUFSIZE	-2606
*/\	-2607
-1]:\	-2608
ector	-2609
▁here	-2610
▁\'(\'	-2611
▁5;	-2612
ossible	-2613
div	-2614
copy	-2615
link	-2616
▁pass	-2617
▁lb	-2618
md	-2619
==0)\	-2620
tsc	-2621
Size	-2622
▁letter	-2623
ob	-2624
pi	-2625
[3];\	-2626
1111	-2627
counter	-2628
▁FOR	-2629
tflag	-2630
▁DFS	-2631
▁multi	-2632
▁bs	-2633
sse	-2634
▁TODO	-2635
▁tok	-2636
pb	-2637
hash	-2638
▁4,	-2639
[2],	-2640
\345\21	-2641
(\'1	-2642
▁seq	-2643
]).	-2644
▁"#!	-2645
var	-2646
usr	-2647
tok	-2648
▁vs	-2649
▁-1:\	-2650
▁dict	-2651
▁win	-2652
-1],	-2653
Buffer	-2654
▁delta	-2655
tret	-2656
del	-2657
trecursion	-2658
trecursionlimit	-2659
sol	-2660
77	-2661
ms	-2662
ordered	-2663
▁stk	-2664
FF	-2665
▁12	-2666
▁{-1,	-2667
nstatic	-2668
▁10,	-2669
▁Code	-2670
▁sk	-2671
thod	-2672
▁EOF	-2673
calc	-2674
LO	-2675
nj	-2676
ncnt	-2677
\357\27	-2678
▁rs	-2679
▁100000	-2680
sx	-2681
▁level	-2682
▁dic	-2683
my	-2684
alf	-2685
ecimal	-2686
FormatException	-2687
hasNext	-2688
▁cho	-2689
▁greater	-2690
▁am	-2691
▁]	-2692
containsKey	-2693
▁-1;	-2694
state	-2695
▁insert	-2696
]=1;\	-2697
4;\	-2698
ure	-2699
_1	-2700
▁acc	-2701
eros	-2702
<=1	-2703
3.	-2704
vl	-2705
af	-2706
▁coding	-2707
(1<<	-2708
****************	-2709
▁ai	-2710
▁ld	-2711
())))\	-2712
Sort	-2713
▁use	-2714
ya	-2715
++;	-2716
SIZE	-2717
problem	-2718
rs	-2719
)//	-2720
\"+	-2721
[200005];\	-2722
55	-2723
▁ti	-2724
▁tx	-2725
depth	-2726
bb	-2727
]);	-2728
▁cand	-2729
],\	-2730
7\27	-2731
==\"	-2732
[0][1]	-2733
▁block	-2734
AN	-2735
ones	-2736
)>	-2737
\343\202\213	-2738
pe	-2739
▁flush	-2740
]=\'	-2741
6;\	-2742
[0]+	-2743
nmod	-2744
)*(	-2745
:]\	-2746
2){\	-2747
])"	-2748
\351\2	-2749
▁close	-2750
oo	-2751
operator	-2752
nC	-2753
ndp	-2754
uiltin	-2755
tuple	-2756
/2)	-2757
rect	-2758
1),	-2759
seq	-2760
/(	-2761
exp	-2762
reated	-2763
cept	-2764
Character	-2765
/*\	-2766
[0][0	-2767
ulate	-2768
rbegin	-2769
ish	-2770
ios	-2771
▁rd	-2772
use	-2773
Print	-2774
builtin	-2775
▁Z	-2776
0\2	-2777
[30	-2778
getchar	-2779
\");	-2780
▁"#!/	-2781
▁OutputWriter	-2782
▁3.	-2783
gener	-2784
▁%\	-2785
▁func	-2786
▁20000	-2787
mpossible	-2788
....	-2789
0[	-2790
tmap	-2791
-1]+	-2792
▁nr	-2793
\"))	-2794
▁-1):\	-2795
man	-2796
[500	-2797
White	-2798
▁1};\	-2799
▁~	-2800
4\2	-2801
==0){\	-2802
[\"	-2803
INE	-2804
▁db	-2805
▁1]\	-2806
▁bad	-2807
[100005],	-2808
▁cs	-2809
▁Min	-2810
poll	-2811
%3	-2812
▁3:\	-2813
ttemp	-2814
▁divis	-2815
▁numChars	-2816
quence	-2817
tFast	-2818
▁comb	-2819
▁tag	-2820
▁ins	-2821
grid	-2822
▁same	-2823
ucky	-2824
▁utf	-2825
(5	-2826
_2	-2827
atrix	-2828
4\	-2829
]=0;\	-2830
Left	-2831
▁red	-2832
()));\	-2833
▁{0};\	-2834
nsum	-2835
[2*	-2836
▁readline	-2837
▁1))\	-2838
▁100;\	-2839
▁ff	-2840
])%	-2841
▁\"\"\	-2842
▁suf	-2843
keys	-2844
▁\');\	-2845
cmp	-2846
▁\'\'\	-2847
ead	-2848
power	-2849
▁possible	-2850
element	-2851
▁values	-2852
2++;\	-2853
[0]=	-2854
()]	-2855
▁mas	-2856
45	-2857
HashSet	-2858
8,	-2859
curChar	-2860
▁contains	-2861
▁ask	-2862
fore	-2863
==1)	-2864
▁[0]*	-2865
--;	-2866
arge	-2867
[100010];\	-2868
▁\'1\'	-2869
://	-2870
(2)\	-2871
ops	-2872
▁(!(	-2873
expr	-2874
▁lis	-2875
65	-2876
ice	-2877
▁sr	-2878
abc	-2879
▁Int	-2880
▁Comparable	-2881
ample	-2882
-9;\	-2883
olver	-2884
bs	-2885
▁so	-2886
▁Seg	-2887
▁template	-2888
win	-2889
▁1){\	-2890
▁method	-2891
nmain	-2892
]<=	-2893
pha	-2894
▁15	-2895
31	-2896
▁8;	-2897
-1))	-2898
▁isSpaceChar	-2899
ative	-2900
▁Col	-2901
▁ms	-2902
={	-2903
][1]);\	-2904
yes	-2905
move	-2906
▁2][	-2907
4;	-2908
level	-2909
▁python	-2910
*10	-2911
▁sl	-2912
matrix	-2913
hift	-2914
0)\	-2915
tA	-2916
▁freopen	-2917
ource	-2918
▁Auto	-2919
2\20	-2920
-1].	-2921
▁(\"	-2922
sin	-2923
▁nc	-2924
00;	-2925
▁sep	-2926
les	-2927
▁son	-2928
▁2):\	-2929
\343\202\22	-2930
▁lines	-2931
▁2],	-2932
cs	-2933
▁nb	-2934
[2])	-2935
tT	-2936
▁dat	-2937
tmem	-2938
xy	-2939
mon	-2940
▁\',	-2941
▁tri	-2942
nz	-2943
9)	-2944
clock	-2945
nS	-2946
▁\")	-2947
two	-2948
)==\'	-2949
generated	-2950
▁LinkedList	-2951
env	-2952
▁done	-2953
numbers	-2954
▁compareTo	-2955
159	-2956
AT	-2957
bitset	-2958
]+=1\	-2959
fter	-2960
floor	-2961
\343\202\222	-2962
\343\2	-2963
(;	-2964
▁day	-2965
▁CF	-2966
▁will	-2967
▁cont	-2968
▁zip	-2969
deque	-2970
lett	-2971
▁rest	-2972
ache	-2973
▁jj	-2974
▁$	-2975
\343\201\20	-2976
▁integers	-2977
AL	-2978
▁sw	-2979
▁off	-2980
▁random	-2981
▁mult	-2982
▁xs	-2983
▁0:	-2984
[-	-2985
nodes	-2986
▁TaskA	-2987
14159	-2988
\345\20	-2989
2],	-2990
▁sign	-2991
DE	-2992
ertex	-2993
udge	-2994
mo	-2995
▁9;	-2996
26\2	-2997
[1][1]	-2998
lazy	-2999
(3,	-3000
▁(1)	-3001
ready	-3002
▁327	-3003
▁bi	-3004
▁dr	-3005
Impossible	-3006
Dist	-3007
BU	-3008
▁10);\	-3009
▁ones	-3010
layer	-3011
1415926	-3012
4)	-3013
▁na	-3014
table	-3015
+1)]\	-3016
▁(~	-3017
maxi	-3018
oly	-3019
▁ev	-3020
▁priority	-3021
3)\	-3022
Cnt	-3023
▁prefix	-3024
tstr	-3025
▁31,	-3026
▁modify	-3027
vals	-3028
▁match	-3029
...);\	-3030
[11	-3031
▁-*-\	-3032
▁split	-3033
▁prod	-3034
tcase	-3035
100];\	-3036
[1][0]	-3037
▁\'.\'	-3038
+\'	-3039
▁7,	-3040
[30000	-3041
!=1	-3042
Cost	-3043
pq	-3044
▁sq	-3045
illis	-3046
nnum	-3047
ory	-3048
-2)	-3049
trim	-3050
iter	-3051
3);\	-3052
uper	-3053
points	-3054
&1)	-3055
▁rank	-3056
2+	-3057
>());\	-3058
mini	-3059
InputReader	-3060
▁0))	-3061
%10	-3062
Lo	-3063
,(	-3064
1:	-3065
qual	-3066
][1]\	-3067
▁ts	-3068
oney	-3069
nex	-3070
▁app	-3071
▁your	-3072
GE	-3073
[10];\	-3074
pw	-3075
(-1,	-3076
IG	-3077
ef	-3078
currentTime	-3079
text	-3080
9\	-3081
ik	-3082
Millis	-3083
pa	-3084
enter	-3085
▁32768	-3086
ail	-3087
dle	-3088
▁Ch	-3089
>0)	-3090
getvalue	-3091
zz	-3092
▁cycle	-3093
quare	-3094
ima	-3095
need	-3096
38	-3097
dec	-3098
-2,	-3099
oot	-3100
▁\'-\'	-3101
Str	-3102
▁2))	-3103
▁Args	-3104
▁10\	-3105
pro	-3106
141592653	-3107
None	-3108
lect	-3109
ttmp	-3110
▁minn	-3111
▁board	-3112
=1,	-3113
ds	-3114
110	-3115
Buffered	-3116
▁ql	-3117
(\"-1\\	-3118
]={	-3119
side	-3120
LINE	-3121
▁1000000007\	-3122
▁turn	-3123
}\"	-3124
2));\	-3125
PUT	-3126
bi	-3127
Idx	-3128
▁only	-3129
(10,	-3130
UM	-3131
21	-3132
ores	-3133
▁Add	-3134
+1))	-3135
+1]-	-3136
\346\225\2	-3137
lt	-3138
mm	-3139
(-1.0);\	-3140
▁5)	-3141
▁team	-3142
ph	-3143
▁ds	-3144
▁TaskB	-3145
▁choose	-3146
)(1	-3147
lib	-3148
▁limit	-3149
[4];\	-3150
board	-3151
dic	-3152
▁cross	-3153
[])\	-3154
▁valid	-3155
][4	-3156
9;	-3157
>=1	-3158
▁});\	-3159
lete	-3160
▁9;\	-3161
search	-3162
unique	-3163
.0;\	-3164
%=	-3165
RE	-3166
▁\'9\'	-3167
2))	-3168
[0]]	-3169
▁moves	-3170
lobal	-3171
▁\')\'	-3172
▁32768);\	-3173
mas	-3174
multi	-3175
▁distance	-3176
▁println	-3177
Decimal	-3178
9];\	-3179
tP	-3180
ints	-3181
loc	-3182
▁oo	-3183
bisect	-3184
items	-3185
-\'	-3186
sent	-3187
▁times	-3188
()).	-3189
inter	-3190
▁\"/	-3191
▁argc	-3192
tern	-3193
==1):\	-3194
good	-3195
][100	-3196
▁visit	-3197
▁[[	-3198
▁Map	-3199
sep	-3200
valid	-3201
ntry	-3202
▁any	-3203
▁sqr	-3204
lity	-3205
▁copy	-3206
▁5];\	-3207
=\'\')\	-3208
▁begin	-3209
rank	-3210
]+\"	-3211
]>=	-3212
[-1]\	-3213
▁small	-3214
[200000	-3215
20\2	-3216
tail	-3217
filen	-3218
▁6;	-3219
ply	-3220
riends	-3221
[1,	-3222
uffle	-3223
1].	-3224
▁-\	-3225
1*	-3226
End	-3227
ights	-3228
nL	-3229
+1],	-3230
idth	-3231
puts	-3232
▁av	-3233
▁Random	-3234
▁itr	-3235
kk	-3236
=[0]*	-3237
▁Get	-3238
3];\	-3239
▁sin	-3240
▁[\'	-3241
▁rhs	-3242
▁back	-3243
]=1\	-3244
▁iter	-3245
Find	-3246
▁stub	-3247
by	-3248
(\'\'.	-3249
Right	-3250
▁pe	-3251
+1])	-3252
nconstexpr	-3253
][0]);\	-3254
wt	-3255
=\"\")\	-3256
▁link	-3257
ars	-3258
▁np	-3259
[26];\	-3260
▁loop	-3261
eric	-3262
]]\	-3263
nod	-3264
▁0),	-3265
▁height	-3266
\346\225\260	-3267
assign	-3268
▁200	-3269
▁position	-3270
assert	-3271
▁50	-3272
vs	-3273
\344\270\2	-3274
▁binary	-3275
▁qq	-3276
▁weight	-3277
>[]	-3278
ci	-3279
dif	-3280
▁ht	-3281
stdlib	-3282
▁TreeSet	-3283
▁curChar	-3284
appop	-3285
uce	-3286
▁3.141592653	-3287
▁11	-3288
\321\20	-3289
actions	-3290
uy	-3291
tS	-3292
src	-3293
▁us	-3294
nion	-3295
][2],	-3296
pii	-3297
%4	-3298
\"),	-3299
ected	-3300
pref	-3301
▁factorial	-3302
nname	-3303
big	-3304
3]	-3305
▁&=	-3306
---	-3307
▁vals	-3308
-1]*	-3309
raph	-3310
▁rot	-3311
tag	-3312
itch	-3313
wargs	-3314
▁((1	-3315
deep	-3316
66	-3317
freq	-3318
)/2;\	-3319
▁\'))\	-3320
▁Print	-3321
It	-3322
[1024	-3323
▁sieve	-3324
>0):\	-3325
▁parse	-3326
-1]);\	-3327
stk	-3328
stra	-3329
7];\	-3330
MX	-3331
)((	-3332
ele	-3333
[2]);\	-3334
▁Solve	-3335
▁Set	-3336
DP	-3337
And	-3338
swap	-3339
▁Problem	-3340
encode	-3341
(1)	-3342
oi	-3343
)).	-3344
+1])\	-3345
mand	-3346
ould	-3347
SS	-3348
▁Read	-3349
▁den	-3350
[2])\	-3351
ka	-3352
▁//=	-3353
-1)*	-3354
itr	-3355
-1){\	-3356
tresult	-3357
▁isPrime	-3358
▁area	-3359
aken	-3360
tfinal	-3361
nstd	-3362
ueries	-3363
[*	-3364
ho	-3365
Bit	-3366
▁cp	-3367
Length	-3368
▁permut	-3369
umn	-3370
/=	-3371
UD	-3372
▁(\'	-3373
▁group	-3374
63	-3375
▁Ex	-3376
▁field	-3377
Name	-3378
\']\	-3379
▁dfn	-3380
\"]	-3381
unordered	-3382
=-1;\	-3383
▁was	-3384
<<\'	-3385
change	-3386
cases	-3387
ao	-3388
▁<<=	-3389
](	-3390
=10	-3391
ates	-3392
+1]:\	-3393
)];\	-3394
▁1000000007)	-3395
tdo	-3396
)+\"	-3397
hich	-3398
▁problem	-3399
[5]	-3400
jj	-3401
off	-3402
▁Collections	-3403
2))\	-3404
▁vl	-3405
Id	-3406
+1]\	-3407
]==\'1	-3408
)<	-3409
weight	-3410
-1,-1):\	-3411
3:\	-3412
)++)	-3413
[2].	-3414
nP	-3415
gram	-3416
▁tab	-3417
tM	-3418
▁1][0]	-3419
IL	-3420
func	-3421
▁tail	-3422
▁filter	-3423
3(	-3424
▁cx	-3425
▁nex	-3426
()-1;\	-3427
3\27	-3428
▁TaskC	-3429
▁suff	-3430
ze	-3431
▁nw	-3432
71	-3433
bjects	-3434
-1]-	-3435
>0){\	-3436
▁7\	-3437
;}	-3438
maxN	-3439
Pow	-3440
sec	-3441
limits	-3442
ONLINE	-3443
▁3);\	-3444
▁!(	-3445
▁register	-3446
▁30	-3447
▁PriorityQueue	-3448
1[0]	-3449
Data	-3450
istream	-3451
36	-3452
memo	-3453
\"\\	-3454
codeforces	-3455
owel	-3456
EN	-3457
tREP	-3458
rec	-3459
▁elem	-3460
tpos	-3461
▁given	-3462
tps	-3463
▁px	-3464
▁Find	-3465
▁loc	-3466
▁adde	-3467
lice	-3468
vide	-3469
▁FileNotFound	-3470
\'))\	-3471
]*(	-3472
[100001];\	-3473
package	-3474
ott	-3475
▁lca	-3476
ttokenizer	-3477
rono	-3478
▁floor	-3479
[::-1]\	-3480
34\2	-3481
Second	-3482
fin	-3483
tz	-3484
\'9	-3485
nextDouble	-3486
▁place	-3487
▁For	-3488
chr	-3489
oups	-3490
maxx	-3491
▁::	-3492
ress	-3493
earch	-3494
▁1:	-3495
tadd	-3496
ACK	-3497
alle	-3498
▁[&	-3499
argv	-3500
oins	-3501
+1));\	-3502
pppppppp	-3503
eed	-3504
▁ax	-3505
10\342\2	-3506
▁seen	-3507
]]=	-3508
▁err	-3509
Up	-3510
▁remain	-3511
FileNotFound	-3512
\":\"	-3513
tu	-3514
[];\	-3515
+1)%	-3516
attern	-3517
final	-3518
tlist	-3519
<10	-3520
CodePoint	-3521
},\	-3522
cstdlib	-3523
________	-3524
)-1):\	-3525
-1)/	-3526
▁token	-3527
;)	-3528
\342\200\2	-3529
//2)	-3530
▁dot	-3531
10\2	-3532
vv	-3533
▁ele	-3534
height	-3535
All	-3536
▁days	-3537
Deque	-3538
ie	-3539
5897	-3540
==1)\	-3541
[100];\	-3542
▁ln	-3543
▁2));\	-3544
RO	-3545
[1]-	-3546
ists	-3547
▁hasNext	-3548
▁IOBase	-3549
)-1	-3550
Read	-3551
+1))\	-3552
▁...	-3553
▁To	-3554
\343\201\253	-3555
(2);\	-3556
here	-3557
▁\'?\')	-3558
(\"2	-3559
▁part	-3560
199	-3561
cpy	-3562
Counter	-3563
)!=	-3564
][0]\	-3565
trunc	-3566
▁super	-3567
\']++;\	-3568
▁\"))\	-3569
field	-3570
ircle	-3571
000];\	-3572
==1){\	-3573
appendCodePoint	-3574
1==	-3575
▁da	-3576
▁100;	-3577
=100000000	-3578
typeof	-3579
nlist	-3580
tmemset	-3581
oc	-3582
info	-3583
ning	-3584
entr	-3585
[300	-3586
nflag	-3587
▁\'0\',	-3588
▁tb	-3589
▁vp	-3590
▁819	-3591
+1]=	-3592
ctools	-3593
versed	-3594
,0	-3595
ingle	-3596
ru	-3597
sta	-3598
5]	-3599
▁prob	-3600
?\"	-3601
\343\203\20	-3602
▁hs	-3603
][(	-3604
[]){\	-3605
9+7;\	-3606
▁17	-3607
7\275	-3608
One	-3609
▁opt	-3610
▁sta	-3611
(10**	-3612
▁4\	-3613
PI	-3614
▁cum	-3615
▁skip	-3616
▁bf	-3617
▁tuple	-3618
▁sec	-3619
▁norm	-3620
-1]=	-3621
▁rb	-3622
]:	-3623
px	-3624
[0]-	-3625
▁ull	-3626
▁fail	-3627
▁1000000	-3628
▁ST	-3629
▁rx	-3630
truncate	-3631
={}\	-3632
[1024];\	-3633
nmin	-3634
▁remove	-3635
compareTo	-3636
▁{};\	-3637
[50000	-3638
>0)\	-3639
Last	-3640
▁1]]	-3641
▁req	-3642
[100010],	-3643
tC	-3644
▁\'9\')\	-3645
[0:	-3646
AAAAAAAA	-3647
10,	-3648
▁[[]	-3649
ollow	-3650
▁factor	-3651
eta	-3652
[2]\	-3653
//2)\	-3654
▁flg	-3655
hed	-3656
▁/*	-3657
58979	-3658
▁minimum	-3659
[200005],	-3660
FileReader	-3661
lb	-3662
)%2	-3663
▁ca	-3664
▁scn	-3665
20\	-3666
UDGE	-3667
ee	-3668
▁cn	-3669
▁\"\	-3670
▁there	-3671
▁obj	-3672
35	-3673
rows	-3674
cale	-3675
▁\":	-3676
00\20	-3677
▁comment	-3678
siz	-3679
▁dq	-3680
▁global	-3681
90	-3682
▁30,	-3683
sl	-3684
aux	-3685
tstd	-3686
();}	-3687
ev	-3688
]==0:\	-3689
LinkedList	-3690
▁dig	-3691
fileno	-3692
▁\')	-3693
62	-3694
riend	-3695
▁2].	-3696
▁8192\	-3697
▁500	-3698
▁2);	-3699
▁names	-3700
1))	-3701
2),	-3702
▁chmax	-3703
indexOf	-3704
nBUFSIZE	-3705
rop	-3706
▁oper	-3707
26\210\342\2	-3708
▁lg	-3709
ets	-3710
och	-3711
{0,	-3712
ighb	-3713
part	-3714
▁newlines	-3715
CK	-3716
linker	-3717
random	-3718
6\	-3719
5);\	-3720
npos	-3721
=\"\"\	-3722
nM	-3723
hedron	-3724
xs	-3725
▁chmin	-3726
Res	-3727
ref	-3728
000;\	-3729
▁hh	-3730
▁steps	-3731
(26	-3732
2].	-3733
▁0},	-3734
JUDGE	-3735
[-1])\	-3736
cx	-3737
▁9)	-3738
5)\	-3739
▁60	-3740
▁LI	-3741
▁which	-3742
1));\	-3743
complex	-3744
▁package	-3745
▁cor	-3746
!!	-3747
[0]:\	-3748
ONG	-3749
[-2	-3750
▁3)\	-3751
][]	-3752
▁qpow	-3753
\'+	-3754
rend	-3755
▁follow	-3756
▁(__	-3757
tios	-3758
▁maximum	-3759
▁.	-3760
▁bal	-3761
tFastScanner	-3762
lip	-3763
**2	-3764
▁modul	-3765
▁dice	-3766
Seg	-3767
real	-3768
ople	-3769
00010;\	-3770
rror	-3771
19937	-3772
][3];\	-3773
Pointer	-3774
67	-3775
▁Matrix	-3776
popcount	-3777
▁rows	-3778
Ofast	-3779
let	-3780
gt	-3781
0},	-3782
dice	-3783
ather	-3784
▁isp	-3785
\345\27	-3786
=2	-3787
][3]	-3788
Compar	-3789
group	-3790
Entry	-3791
[1]:\	-3792
▁fractions	-3793
▁lx	-3794
visit	-3795
ndi	-3796
▁NULL	-3797
()-	-3798
▁Data	-3799
▁pairs	-3800
arry	-3801
▁take	-3802
▁Vector	-3803
Fact	-3804
(\"%.10	-3805
▁fflush	-3806
igDecimal	-3807
>>(	-3808
cont	-3809
▁Segment	-3810
▁rm	-3811
▁ru	-3812
\343\203\27	-3813
▁Comparator	-3814
▁(_	-3815
▁pd	-3816
▁[&](	-3817
2>\	-3818
ote	-3819
tcatch	-3820
▁search	-3821
▁ke	-3822
▁vc	-3823
Search	-3824
\343\201\247	-3825
\321\2	-3826
▁rc	-3827
[1]]	-3828
do	-3829
▁factors	-3830
▁digits	-3831
<1	-3832
(\"-	-3833
\"):\	-3834
▁\'\'.	-3835
▁shift	-3836
Th	-3837
▁unique	-3838
▁except	-3839
ql	-3840
INT	-3841
▁ay	-3842
tset	-3843
1,0,	-3844
vertex	-3845
▁half	-3846
▁\'1\';\	-3847
[_	-3848
▁nextIntArray	-3849
eps	-3850
▁function	-3851
]])\	-3852
chrono	-3853
22	-3854
roll	-3855
found	-3856
}\'	-3857
[0]*(	-3858
▁sums	-3859
=-1\	-3860
▁\"(\"	-3861
▁words	-3862
▁counts	-3863
0),	-3864
gion	-3865
▁rand	-3866
team	-3867
▁It	-3868
9+7\	-3869
▁ara	-3870
%2!=0	-3871
▁before	-3872
CH	-3873
manip	-3874
any	-3875
▁\'4	-3876
ins	-3877
▁StringBuffer	-3878
.__	-3879
oto	-3880
<4;	-3881
iomanip	-3882
factorial	-3883
binations	-3884
▁\'#\')	-3885
+2)	-3886
cp	-3887
block	-3888
▁side	-3889
target	-3890
▁ci	-3891
▁lt	-3892
+=1	-3893
▁tem	-3894
tar	-3895
▁pop	-3896
]==\'0	-3897
▁functools	-3898
)))"	-3899
3=	-3900
rest	-3901
▁1});\	-3902
▁middle	-3903
nnamespace	-3904
42	-3905
▁process	-3906
suf	-3907
cross	-3908
▁trans	-3909
▁1.	-3910
▁Union	-3911
\'0\';\	-3912
Comparator	-3913
▁5\	-3914
▁gg	-3915
(\".	-3916
%2==0):\	-3917
[5];\	-3918
▁perm	-3919
MP	-3920
Element	-3921
param	-3922
nu	-3923
▁25	-3924
same	-3925
▁BIT	-3926
]]--;\	-3927
▁(0,	-3928
words	-3929
(),(	-3930
▁fib	-3931
argest	-3932
▁1][1]	-3933
ood	-3934
▁es	-3935
(100	-3936
▁gc	-3937
▁space	-3938
flg	-3939
▁price	-3940
2[0]	-3941
▁src	-3942
][1])\	-3943
Row	-3944
▁dsu	-3945
▁—	-3946
▁AN	-3947
41	-3948
▁19	-3949
+1)*	-3950
%(	-3951
AS	-3952
▁ways	-3953
▁tar	-3954
tadj	-3955
▁old	-3956
token	-3957
10][	-3958
▁Query	-3959
▁complex	-3960
[3][	-3961
/2);\	-3962
================	-3963
]==1:\	-3964
2>	-3965
twriter	-3966
▁bx	-3967
form	-3968
\";	-3969
jkstra	-3970
FFER	-3971
avx	-3972
itive	-3973
onent	-3974
fx	-3975
▁LO	-3976
hird	-3977
-1))\	-3978
[1]=	-3979
▁Sum	-3980
▁\"]	-3981
position	-3982
Sub	-3983
0:	-3984
1){\	-3985
[3],	-3986
eat	-3987
nunsigned	-3988
cycle	-3989
▁task	-3990
ottom	-3991
▁initial	-3992
▁MX	-3993
33\2	-3994
tG	-3995
20];\	-3996
ments	-3997
8;\	-3998
STACK	-3999
<=0	-4000
lace	-4001
ID	-4002
opt	-4003
▁xy	-4004
▁ys	-4005
][0].	-4006
catch	-4007
ToString	-4008
3456	-4009
ouse	-4010
[0]==	-4011
))%	-4012
(0).	-4013
ten	-4014
1010	-4015
▁coord	-4016
▁20;	-4017
texit	-4018
ba	-4019
▁Array	-4020
Error	-4021
letter	-4022
Or	-4023
▁6,	-4024
▁\"%	-4025
uch	-4026
()];\	-4027
nnable	-4028
acc	-4029
Filter	-4030
▁Thread	-4031
▁heappush	-4032
&&(	-4033
▁than	-4034
nqueue	-4035
▁cut	-4036
▁24	-4037
▁card	-4038
=10**	-4039
tices	-4040
▁\'2	-4041
▁\'7	-4042
TreeSet	-4043
bad	-4044
card	-4045
names	-4046
▁nm	-4047
fault	-4048
▁Runnable	-4049
(6	-4050
tB	-4051
PO	-4052
▁[0,	-4053
?\302\2	-4054
prod	-4055
2])	-4056
sect	-4057
[100000];\	-4058
(1){\	-4059
inc	-4060
▁13	-4061
nresult	-4062
-8;\	-4063
▁6;\	-4064
}};\	-4065
▁element	-4066
▁then	-4067
(\"1\");\	-4068
998244353	-4069
▁addedge	-4070
\357\277\275	-4071
gy	-4072
▁black	-4073
\343\201\204	-4074
5897932	-4075
[8]	-4076
[0]),	-4077
since	-4078
State	-4079
readInt	-4080
tInputStream	-4081
debug	-4082
▁reduce	-4083
alpha	-4084
▁If	-4085
▁kol	-4086
▁{\'	-4087
BUG	-4088
ntotal	-4089
▁struct	-4090
[2000	-4091
▁bel	-4092
erty	-4093
dat	-4094
▁7)	-4095
▁after	-4096
▁1)]	-4097
▁31	-4098
functional	-4099
▁vx	-4100
MN	-4101
lass	-4102
▁+=1\	-4103
▁ready	-4104
Default	-4105
▁clock	-4106
\320\276	-4107
<3;	-4108
▁ck	-4109
▁cards	-4110
umulate	-4111
[1000005];\	-4112
reate	-4113
▁No	-4114
rees	-4115
▁1000;\	-4116
sign	-4117
50];\	-4118
▁*(	-4119
▁cons	-4120
allest	-4121
▁three	-4122
▁%.	-4123
▁1000000000;\	-4124
mb	-4125
distance	-4126
▁GCD	-4127
\346\234\2	-4128
den	-4129
\343\201\250	-4130
▁where	-4131
[{	-4132
xi	-4133
=2\	-4134
\343\200\20	-4135
version	-4136
▁\'*\')	-4137
3*	-4138
small	-4139
????????????????	-4140
arts	-4141
ulti	-4142
9);\	-4143
▁letters	-4144
[105];\	-4145
uc	-4146
jkl	-4147
▁deep	-4148
▁Created	-4149
▁FileInputStream	-4150
_,	-4151
primes	-4152
price	-4153
▁1]:\	-4154
▁cf	-4155
589793238	-4156
7)\	-4157
language	-4158
rom	-4159
▁\')]\	-4160
/2\	-4161
▁yi	-4162
endif	-4163
ons	-4164
\'))	-4165
NA	-4166
▁ob	-4167
sstream	-4168
multiply	-4169
▁\343\20	-4170
qui	-4171
▁yes	-4172
led	-4173
▁lp	-4174
days	-4175
▁++(	-4176
▁short	-4177
-1:	-4178
-1),	-4179
++);\	-4180
cos	-4181
▁xi	-4182
▁ip	-4183
0000000	-4184
nlst	-4185
▁permutations	-4186
▁Up	-4187
BufferedWriter	-4188
▁dc	-4189
!=0)	-4190
fail	-4191
times	-4192
-1));\	-4193
])-	-4194
db	-4195
work	-4196
[200010];\	-4197
utility	-4198
10**	-4199
▁Line	-4200
epoch	-4201
▁single	-4202
▁nt	-4203
][0]=	-4204
▁mint	-4205
▁round	-4206
permut	-4207
▁\'.\';\	-4208
▁uf	-4209
**0.	-4210
ffff	-4211
▁\')))\	-4212
▁sequence	-4213
▁jump	-4214
▁nod	-4215
+=\"	-4216
▁suma	-4217
=\'\'\	-4218
Ind	-4219
peek	-4220
alind	-4221
▁nextChar	-4222
InputMismatch	-4223
ward	-4224
7)	-4225
ia	-4226
▁1},	-4227
defaultdict	-4228
OK	-4229
▁20;\	-4230
▁resp	-4231
Add	-4232
▁zz	-4233
hip	-4234
▁10];\	-4235
!=\'	-4236
LOCK	-4237
▁din	-4238
tstart	-4239
▁ub	-4240
▁stud	-4241
{\"	-4242
most	-4243
tputs	-4244
(8	-4245
▁64	-4246
numeric	-4247
ube	-4248
Fast	-4249
rection	-4250
tab	-4251
▁ng	-4252
Ord	-4253
!=0){\	-4254
▁vertex	-4255
[26	-4256
▁stat	-4257
▁cases	-4258
)<=	-4259
▁mon	-4260
uture	-4261
so	-4262
\").	-4263
▁100005;\	-4264
StreamTokenizer	-4265
nmt	-4266
\343\201\252	-4267
000;	-4268
▁rng	-4269
loops	-4270
▁readLong	-4271
\343\201\214	-4272
<0:\	-4273
▁fabs	-4274
Path	-4275
Main	-4276
ours	-4277
ole	-4278
6)\	-4279
▁pushdown	-4280
(\"0\\	-4281
its	-4282
▁{\"	-4283
==2:\	-4284
\343\201\246	-4285
AP	-4286
awt	-4287
▁vy	-4288
▁cb	-4289
ttotal	-4290
deepToString	-4291
)>=	-4292
Maxn	-4293
▁should	-4294
▁prv	-4295
▁++;\	-4296
tList	-4297
bf	-4298
-1,0,	-4299
▁cou	-4300
▁equal	-4301
\'&&	-4302
▁pts	-4303
dig	-4304
tInputReader	-4305
▁=0;	-4306
50\2	-4307
Vector	-4308
chk	-4309
▁hm	-4310
▁way	-4311
▁colors	-4312
>>>	-4313
popleft	-4314
▁bw	-4315
filter	-4316
{\'	-4317
▁union	-4318
▁\'9\';	-4319
[(1	-4320
\345\220\2	-4321
▁vr	-4322
▁tk	-4323
51	-4324
<0)	-4325
][0][	-4326
ple	-4327
uv	-4328
core	-4329
▁argv	-4330
IB	-4331
\""	-4332
▁nC	-4333
▁ctr	-4334
prefix	-4335
OW	-4336
▁Arg	-4337
treader	-4338
\343\201\237	-4339
▁rad	-4340
[9	-4341
minn	-4342
▁48;\	-4343
▁Stack	-4344
UN	-4345
nMOD	-4346
▁summ	-4347
#.	-4348
xyz	-4349
▁more	-4350
▁bc	-4351
done	-4352
elp	-4353
▁brr	-4354
fabs	-4355
58979323846	-4356
\343\201\213	-4357
▁Example	-4358
round	-4359
------------	-4360
ants	-4361
▁year	-4362
▁cd	-4363
▁++)	-4364
cand	-4365
(\'-	-4366
tdist	-4367
▁DE	-4368
79	-4369
nce	-4370
)//2\	-4371
$$	-4372
80	-4373
100],	-4374
nR	-4375
▁queries	-4376
100;\	-4377
1>	-4378
!=0)\	-4379
(\"\".	-4380
▁od	-4381
▁Pow	-4382
▁offset	-4383
[1]+	-4384
(3):\	-4385
acity	-4386
][0][0]	-4387
▁\'>	-4388
▁Codeforces	-4389
▁()	-4390
▁ALL	-4391
▁48);\	-4392
tCollections	-4393
▁sg	-4394
Comp	-4395
2_	-4396
▁te	-4397
tvis	-4398
▁trie	-4399
▁\")))\	-4400
▁friend	-4401
dot	-4402
ious	-4403
ncur	-4404
▁Graph	-4405
tis	-4406
delta	-4407
+3	-4408
▁getline	-4409
############	-4410
▁some	-4411
()->	-4412
dfn	-4413
eded	-4414
over	-4415
▁fir	-4416
][1]=	-4417
▁conn	-4418
▁Next	-4419
▁\"0\"	-4420
▁-(	-4421
ello	-4422
▁gen	-4423
▁zeros	-4424
npriority	-4425
elem	-4426
cn	-4427
ara	-4428
++){	-4429
[1]*	-4430
alk	-4431
plus	-4432
1=0\	-4433
\'][	-4434
_000	-4435
build	-4436
stead	-4437
arning	-4438
▁Solver	-4439
▁Di	-4440
▁\'<	-4441
entry	-4442
+2,	-4443
▁box	-4444
+1<	-4445
OO	-4446
nD	-4447
▁pll	-4448
(0));\	-4449
▁mt	-4450
/2)\	-4451
\\\\	-4452
▁phi	-4453
Order	-4454
▁goal	-4455
▁orig	-4456
{}	-4457
gic	-4458
▁ba	-4459
▁HER	-4460
(5):\	-4461
▁nextString	-4462
II	-4463
0:\	-4464
year	-4465
-->0)	-4466
▁occ	-4467
111	-4468
ats	-4469
Locale	-4470
▁dt	-4471
▁bits	-4472
?\	-4473
-->0)\	-4474
▁ANS	-4475
▁judge	-4476
▁command	-4477
\'*	-4478
ide	-4479
▁[1,	-4480
▁0.0;\	-4481
▁tw	-4482
tlast	-4483
▁ww	-4484
▁\"?	-4485
_(	-4486
2\202	-4487
▁1]][	-4488
▁Comp	-4489
\343\203\274	-4490
hm	-4491
4];\	-4492
▁\"+(	-4493
[6]	-4494
binary	-4495
*10+	-4496
▁ter	-4497
!=0):\	-4498
▁sn	-4499
▁2.0	-4500
nval	-4501
▁vt	-4502
(\"?	-4503
▁\'1\':\	-4504
88	-4505
sq	-4506
Diff	-4507
ject	-4508
\345\25	-4509
▁switch	-4510
100000000	-4511
▁998244353\	-4512
[40	-4513
