▁t	-0
<unk>	0
<s>	0
</s>	0
he	-1
in	-2
▁a	-3
▁the	-4
▁o	-5
er	-6
▁s	-7
▁c	-8
re	-9
ut	-10
▁1	-11
on	-12
es	-13
▁i	-14
▁of	-15
▁n	-16
at	-17
▁p	-18
▁in	-19
▁f	-20
le	-21
▁b	-22
▁w	-23
en	-24
▁an	-25
put	-26
an	-27
ing	-28
▁to	-29
▁m	-30
or	-31
▁2	-32
▁d	-33
ed	-34
st	-35
▁is	-36
▁I	-37
it	-38
ll	-39
▁and	-40
▁l	-41
▁e	-42
um	-43
▁th	-44
▁T	-45
ou	-46
ar	-47
ac	-48
▁3	-49
ro	-50
▁≤	-51
te	-52
▁In	-53
as	-54
▁(	-55
am	-56
al	-57
▁The	-58
▁g	-59
▁h	-60
▁con	-61
ion	-62
▁on	-63
ers	-64
▁O	-65
umb	-66
▁numb	-67
utput	-68
00	-69
ts	-70
ir	-71
ic	-72
ec	-73
im	-74
ain	-75
is	-76
▁0	-77
▁Input	-78
▁4	-79
▁Output	-80
ow	-81
▁that	-82
▁lin	-83
▁number	-84
▁re	-85
ve	-86
▁be	-87
▁are	-88
▁st	-89
qu	-90
teg	-91
▁integ	-92
▁5	-93
ot	-94
ay	-95
▁y	-96
▁A	-97
ly	-98
▁N	-99
▁cont	-100
▁v	-101
ent	-102
ach	-103
os	-104
▁line	-105
om	-106
et	-107
th	-108
▁contain	-109
..	-110
amp	-111
▁10	-112
▁le	-113
▁for	-114
▁can	-115
▁E	-116
si	-117
irst	-118
est	-119
ce	-120
▁ex	-121
ri	-122
▁S	-123
▁first	-124
ith	-125
▁*	-126
▁di	-127
▁one	-128
ble	-129
rom	-130
▁he	-131
ation	-132
▁u	-133
int	-134
▁se	-135
▁each	-136
▁contains	-137
▁with	-138
▁from	-139
▁-	-140
▁or	-141
▁you	-142
ol	-143
▁k	-144
▁as	-145
▁F	-146
▁ch	-147
ge	-148
▁integers	-149
▁6	-150
iv	-151
ill	-152
ter	-153
ct	-154
ample	-155
▁it	-156
▁su	-157
ond	-158
▁(1	-159
ul	-160
wo	-161
▁mo	-162
▁P	-163
▁wh	-164
ring	-165
▁by	-166
se	-167
ld	-168
▁all	-169
her	-170
gh	-171
▁x	-172
▁two	-173
▁at	-174
ase	-175
▁=	-176
).	-177
ad	-178
▁integer	-179
rint	-180
▁pro	-181
▁Y	-182
▁"	-183
▁pos	-184
▁sh	-185
▁fo	-186
▁C	-187
▁—	-188
▁will	-189
▁sec	-190
llow	-191
res	-192
▁ne	-193
▁$	-194
▁if	-195
▁\	-196
▁follow	-197
...	-198
id	-199
▁ro	-200
all	-201
les	-202
▁not	-203
▁r	-204
iven	-205
▁7	-206
ch	-207
▁Ex	-208
ver	-209
▁B	-210
▁second	-211
▁100	-212
ak	-213
der	-214
▁H	-215
1,	-216
ame	-217
▁has	-218
▁given	-219
▁pl	-220
▁string	-221
▁test	-222
▁+	-223
ap	-224
ate	-225
ave	-226
▁there	-227
▁sp	-228
ive	-229
▁<	-230
ur	-231
▁co	-232
▁this	-233
ould	-234
▁You	-235
end	-236
▁M	-237
ents	-238
▁For	-239
▁9	-240
▁8	-241
▁...	-242
2,	-243
▁ar	-244
act	-245
ght	-246
▁j	-247
▁po	-248
▁qu	-249
▁input	-250
ree	-251
),	-252
ther	-253
▁print	-254
▁do	-255
▁no	-256
ect	-257
ence	-258
imum	-259
▁tim	-260
and	-261
ich	-262
per	-263
▁whe	-264
▁any	-265
ome	-266
▁following	-267
ng	-268
▁ver	-269
▁consi	-270
▁have	-271
sible	-272
▁No	-273
age	-274
▁which	-275
oun	-276
ard	-277
▁so	-278
ord	-279
ition	-280
art	-281
▁val	-282
ated	-283
000	-284
ies	-285
▁L	-286
▁min	-287
▁If	-288
▁case	-289
▁al	-290
▁lines	-291
▁example	-292
ell	-293
▁W	-294
amples	-295
ind	-296
▁only	-297
sw	-298
ue	-299
▁com	-300
ess	-301
▁sing	-302
pt	-303
▁single	-304
ip	-305
▁numbers	-306
▁Examples	-307
▁10^	-308
ngth	-309
▁possible	-310
▁ma	-311
▁Note	-312
▁should	-313
ace	-314
▁rep	-315
ff	-316
ast	-317
▁answ	-318
il	-319
▁sequ	-320
de	-321
ment	-322
▁D	-323
▁de	-324
▁length	-325
fter	-326
▁Each	-327
ab	-328
▁other	-329
xt	-330
▁time	-331
ist	-332
▁consist	-333
ks	-334
▁we	-335
▁un	-336
▁col	-337
▁arr	-338
ity	-339
▁char	-340
▁form	-341
us	-342
▁such	-343
iz	-344
ake	-345
▁[	-346
▁sub	-347
▁per	-348
▁order	-349
▁them	-350
▁It	-351
▁equ	-352
ult	-353
ore	-354
▁some	-355
▁his	-356
ally	-357
oc	-358
▁sequence	-359
▁output	-360
leq	-361
▁R	-362
_{	-363
▁answer	-364
▁go	-365
▁...,	-366
str	-367
▁ele	-368
▁1,	-369
ays	-370
we	-371
▁|	-372
▁tr	-373
ments	-374
▁max	-375
▁-1	-376
for	-377
▁pa	-378
gr	-379
▁oper	-380
ang	-381
▁ab	-382
▁equal	-383
ose	-384
rect	-385
▁cell	-386
▁than	-387
our	-388
blem	-389
▁bet	-390
ack	-391
ite	-392
ig	-393
▁Print	-394
ight	-395
image	-396
if	-397
▁res	-398
ong	-399
▁then	-400
0000	-401
10	-402
▁wan	-403
▁same	-404
▁play	-405
em	-406
▁let	-407
▁quer	-408
un	-409
od	-410
▁dist	-411
ween	-412
ions	-413
▁operation	-414
pp	-415
▁between	-416
▁gr	-417
par	-418
ust	-419
▁diff	-420
▁des	-421
ices	-422
▁He	-423
out	-424
▁array	-425
are	-426
▁where	-427
▁value	-428
▁K	-429
▁dec	-430
▁repres	-431
op	-432
▁minimum	-433
ases	-434
▁problem	-435
ure	-436
▁pair	-437
ud	-438
▁cor	-439
▁next	-440
▁1.	-441
▁gu	-442
ice	-443
▁find	-444
▁V	-445
▁does	-446
▁bl	-447
ise	-448
▁ed	-449
ints	-450
▁differ	-451
form	-452
▁int	-453
cri	-454
▁they	-455
▁after	-456
ik	-457
▁G	-458
▁2,	-459
▁There	-460
▁sum	-461
ates	-462
▁ad	-463
▁maximum	-464
▁ri	-465
▁Th	-466
ount	-467
▁three	-468
ine	-469
tal	-470
ft	-471
....	-472
▁Con	-473
▁'	-474
_1	-475
▁descri	-476
gram	-477
▁more	-478
▁need	-479
▁us	-480
▁dat	-481
parated	-482
▁bo	-483
its	-484
▁game	-485
▁end	-486
▁sol	-487
▁wr	-488
▁set	-489
▁12	-490
▁position	-491
UT	-492
strain	-493
▁points	-494
▁vert	-495
▁its	-496
▁rem	-497
▁up	-498
▁but	-499
▁space	-500
▁squ	-501
able	-502
ird	-503
▁exact	-504
ans	-505
▁kn	-506
▁move	-507
▁den	-508
▁cases	-509
▁cho	-510
▁Example	-511
wise	-512
ges	-513
▁man	-514
▁part	-515
yp	-516
pl	-517
ort	-518
▁ai	-519
▁q	-520
ves	-521
▁exactly	-522
▁get	-523
▁11	-524
▁pi	-525
▁program	-526
▁me	-527
▁sample	-528
aph	-529
cc	-530
so	-531
straints	-532
▁third	-533
ya	-534
aran	-535
ange	-536
▁format	-537
##	-538
▁sc	-539
▁tree	-540
▁total	-541
▁inc	-542
ire	-543
▁X	-544
▁left	-545
▁z	-546
ound	-547
very	-548
ie	-549
arante	-550
▁make	-551
▁elements	-552
ower	-553
▁point	-554
▁comp	-555
▁guarante	-556
ath	-557
ance	-558
_1,	-559
▁different	-560
▁20	-561
▁consists	-562
▁0.	-563
ial	-564
▁wants	-565
▁represent	-566
▁guaranteed	-567
tex	-568
▁typ	-569
▁mult	-570
▁know	-571
urn	-572
ordin	-573
▁cl	-574
▁vertices	-575
itt	-576
▁lo	-577
-1	-578
▁conn	-579
ant	-580
▁bec	-581
ous	-582
▁day	-583
▁row	-584
▁road	-585
▁was	-586
_2	-587
imal	-588
one	-589
lp	-590
▁te	-591
ne	-592
▁im	-593
acter	-594
▁she	-595
▁bot	-596
▁.	-597
",	-598
▁mat	-599
▁query	-600
▁out	-601
ize	-602
▁app	-603
acters	-604
ok	-605
ren	-606
▁dig	-607
ors	-608
▁bu	-609
▁must	-610
▁into	-611
▁characters	-612
▁cal	-613
itive	-614
ters	-615
▁denot	-616
pect	-617
▁when	-618
ask	-619
▁Constraints	-620
ass	-621
▁right	-622
▁multip	-623
ary	-624
▁character	-625
ish	-626
11	-627
▁3,	-628
▁am	-629
dition	-630
_2,	-631
▁vertex	-632
▁(0	-633
3,	-634
▁coordin	-635
▁start	-636
▁fl	-637
▁div	-638
▁letters	-639
▁word	-640
ict	-641
ided	-642
▁may	-643
▁connect	-644
▁their	-645
▁your	-646
erm	-647
▁him	-648
▁ob	-649
ces	-650
ide	-651
▁positive	-652
▁requ	-653
ra	-654
ues	-655
▁every	-656
▁1000	-657
▁way	-658
▁path	-659
▁2.	-660
ear	-661
▁en	-662
▁10^5	-663
▁Then	-664
led	-665
▁direct	-666
▁exce	-667
ations	-668
ere	-669
▁card	-670
▁these	-671
▁stud	-672
ES	-673
▁many	-674
▁least	-675
▁Al	-676
▁J	-677
▁ev	-678
av	-679
▁task	-680
PUT	-681
own	-682
▁pre	-683
case	-684
▁new	-685
ove	-686
▁ind	-687
ub	-688
▁{	-689
▁15	-690
▁multiple	-691
▁choose	-692
▁exist	-693
".	-694
▁pr	-695
ough	-696
▁describ	-697
riend	-698
▁four	-699
LE	-700
▁graph	-701
ck	-702
▁mod	-703
▁lik	-704
igh	-705
▁times	-706
ild	-707
gin	-708
▁city	-709
▁seg	-710
▁square	-711
MP	-712
▁An	-713
ater	-714
ets	-715
▁non	-716
ute	-717
▁values	-718
ry	-719
inct	-720
atis	-721
ile	-722
atisf	-723
▁who	-724
▁consisting	-725
▁distinct	-726
▁plan	-727
▁init	-728
el	-729
ick	-730
▁strings	-731
ired	-732
▁operations	-733
▁friend	-734
▁All	-735
▁perm	-736
▁how	-737
ock	-738
ively	-739
▁`	-740
▁10000	-741
▁:	-742
▁SA	-743
MPLE	-744
▁satisf	-745
fore	-746
ag	-747
▁win	-748
▁separated	-749
▁wor	-750
umn	-751
▁edges	-752
▁also	-753
▁em	-754
▁exceed	-755
▁St	-756
tain	-757
uct	-758
▁use	-759
pond	-760
▁SAMPLE	-761
▁permut	-762
▁most	-763
▁After	-764
▁both	-765
pty	-766
▁respect	-767
▁column	-768
▁inter	-769
▁sm	-770
ob	-771
▁Your	-772
▁perform	-773
▁zer	-774
▁type	-775
▁condition	-776
▁consider	-777
▁This	-778
▁50	-779
respond	-780
ical	-781
▁Let	-782
▁cells	-783
ities	-784
▁13	-785
au	-786
▁correspond	-787
],	-788
▁dis	-789
▁size	-790
▁lower	-791
▁decided	-792
akes	-793
cul	-794
▁spec	-795
▁containing	-796
ress	-797
pos	-798
ps	-799
▁>	-800
▁gre	-801
ever	-802
hes	-803
▁10^9	-804
▁000	-805
▁numbered	-806
99	-807
▁respectively	-808
▁How	-809
ning	-810
▁So	-811
▁bel	-812
▁pairs	-813
ither	-814
▁def	-815
wn	-816
▁follows	-817
▁inde	-818
▁⋅	-819
▁queries	-820
urren	-821
▁U	-822
▁lar	-823
▁last	-824
▁cost	-825
▁par	-826
rid	-827
▁edge	-828
▁turn	-829
▁fin	-830
lect	-831
▁color	-832
eterm	-833
▁→	-834
▁(2	-835
not	-836
▁3.	-837
ari	-838
sum	-839
▁result	-840
▁coordinates	-841
▁pe	-842
▁count	-843
▁small	-844
},	-845
▁partic	-846
▁Q	-847
▁distance	-848
▁doesn	-849
ince	-850
▁109	-851
▁connected	-852
▁sy	-853
▁4,	-854
▁digits	-855
▁As	-856
ied	-857
▁str	-858
▁list	-859
▁sim	-860
land	-861
itten	-862
hen	-863
▁comm	-864
▁player	-865
ash	-866
▁element	-867
▁denoting	-868
▁less	-869
▁want	-870
▁Vas	-871
▁1)	-872
▁either	-873
▁We	-874
▁team	-875
ating	-876
separated	-877
▁remain	-878
▁add	-879
▁permutation	-880
0,	-881
vel	-882
▁her	-883
erson	-884
▁written	-885
▁coin	-886
▁take	-887
▁YES	-888
▁opt	-889
▁like	-890
▁good	-891
ause	-892
▁subse	-893
arp	-894
▁room	-895
▁required	-896
cl	-897
▁14	-898
▁correct	-899
▁However	-900
▁16	-901
▁help	-902
ially	-903
ople	-904
▁over	-905
▁solut	-906
▁very	-907
12	-908
▁bi	-909
▁modul	-910
▁loc	-911
app	-912
ative	-913
▁calcul	-914
▁incl	-915
▁cities	-916
▁tri	-917
▁means	-918
▁words	-919
▁Vasya	-920
▁would	-921
▁piec	-922
▁modulo	-923
▁quest	-924
▁person	-925
00000	-926
ular	-927
▁cannot	-928
▁people	-929
▁pass	-930
▁(1,	-931
aces	-932
▁ste	-933
▁0,	-934
ens	-935
ption	-936
▁exists	-937
ix	-938
▁moves	-939
▁state	-940
up	-941
▁rec	-942
▁data	-943
▁First	-944
▁zero	-945
▁To	-946
string	-947
▁On	-948
▁occ	-949
▁initial	-950
▁Po	-951
▁write	-952
▁change	-953
4,	-954
▁even	-955
▁×	-956
▁che	-957
ady	-958
cess	-959
▁amount	-960
▁105	-961
otes	-962
▁roads	-963
▁letter	-964
▁box	-965
other	-966
etermine	-967
sive	-968
▁curren	-969
old	-970
▁grou	-971
▁divis	-972
ways	-973
▁Ne	-974
▁When	-975
ares	-976
igure	-977
ime	-978
the	-979
▁ask	-980
▁rect	-981
aint	-982
ved	-983
reas	-984
▁obtain	-985
▁rectang	-986
▁30	-987
▁xi	-988
▁index	-989
▁NO	-990
].	-991
gn	-992
▁At	-993
▁about	-994
▁lowercase	-995
▁sever	-996
▁..	-997
▁≠	-998
▁cards	-999
rough	-1000
▁corresponding	-1001
ars	-1002
hed	-1003
andard	-1004
▁mar	-1005
▁Help	-1006
▁empty	-1007
aset	-1008
bit	-1009
▁place	-1010
▁several	-1011
▁dataset	-1012
ade	-1013
▁through	-1014
▁Now	-1015
▁once	-1016
ail	-1017
▁Sample	-1018
▁before	-1019
▁because	-1020
▁using	-1021
▁current	-1022
uring	-1023
▁99	-1024
▁ke	-1025
▁Find	-1026
▁substring	-1027
▁cand	-1028
▁above	-1029
▁days	-1030
▁ball	-1031
di	-1032
▁ways	-1033
ences	-1034
rix	-1035
▁long	-1036
▁,	-1037
+1	-1038
▁IN	-1039
▁always	-1040
▁vis	-1041
▁ti	-1042
▁Poly	-1043
▁segment	-1044
▁sw	-1045
▁5,	-1046
▁ent	-1047
ple	-1048
▁indic	-1049
carp	-1050
bo	-1051
tem	-1052
▁score	-1053
▁top	-1054
▁act	-1055
▁represents	-1056
ving	-1057
ically	-1058
▁Polycarp	-1059
▁squares	-1060
ph	-1061
ory	-1062
▁show	-1063
▁cir	-1064
▁Other	-1065
▁begin	-1066
edi	-1067
▁particip	-1068
ush	-1069
▁table	-1070
ides	-1071
ately	-1072
▁read	-1073
▁OUT	-1074
▁needs	-1075
ives	-1076
▁assum	-1077
▁#	-1078
▁friends	-1079
▁another	-1080
▁INPUT	-1081
▁students	-1082
▁OUTPUT	-1083
▁allow	-1084
00000000	-1085
▁put	-1086
ank	-1087
▁br	-1088
▁[1,	-1089
▁buy	-1090
▁18	-1091
▁process	-1092
ner	-1093
▁without	-1094
▁cre	-1095
formation	-1096
cle	-1097
with	-1098
ights	-1099
▁otherwise	-1100
usive	-1101
▁grid	-1102
▁direction	-1103
▁node	-1104
▁name	-1105
plan	-1106
▁conditions	-1107
▁4.	-1108
▁Otherwise	-1109
▁called	-1110
▁Pet	-1111
ons	-1112
▁now	-1113
▁off	-1114
▁....	-1115
5,	-1116
▁Bob	-1117
▁were	-1118
▁red	-1119
▁paint	-1120
▁chang	-1121
ility	-1122
ost	-1123
▁mom	-1124
▁positions	-1125
▁star	-1126
▁trans	-1127
possible	-1128
▁considered	-1129
▁quotes	-1130
▁black	-1131
▁could	-1132
▁matrix	-1133
▁takes	-1134
▁description	-1135
▁17	-1136
▁subsequ	-1137
▁specif	-1138
vers	-1139
▁represented	-1140
▁Standard	-1141
▁digit	-1142
▁down	-1143
▁described	-1144
des	-1145
row	-1146
',	-1147
▁acc	-1148
▁ag	-1149
▁25	-1150
ecut	-1151
▁poly	-1152
without	-1153
▁mon	-1154
▁Next	-1155
▁stre	-1156
jac	-1157
▁round	-1158
planation	-1159
ants	-1160
▁used	-1161
▁leq	-1162
▁build	-1163
get	-1164
▁answers	-1165
}.	-1166
ouse	-1167
▁200	-1168
ames	-1169
▁Alice	-1170
▁Ch	-1171
▁ac	-1172
▁reach	-1173
▁car	-1174
▁work	-1175
ready	-1176
ax	-1177
▁fr	-1178
▁weight	-1179
▁satisfy	-1180
▁height	-1181
▁reg	-1182
lish	-1183
**	-1184
▁what	-1185
▁determine	-1186
▁att	-1187
struct	-1188
utes	-1189
▁already	-1190
lete	-1191
▁item	-1192
▁greater	-1193
uch	-1194
jacent	-1195
▁Given	-1196
ious	-1197
lease	-1198
graph	-1199
▁side	-1200
ator	-1201
unct	-1202
▁er	-1203
▁rece	-1204
ep	-1205
33	-1206
▁yi	-1207
aa	-1208
▁starting	-1209
▁level	-1210
ote	-1211
####	-1212
ined	-1213
▁information	-1214
let	-1215
▁One	-1216
omes	-1217
▁prod	-1218
emb	-1219
ys	-1220
▁-2	-1221
ots	-1222
▁Explanation	-1223
++	-1224
▁rel	-1225
▁id	-1226
bab	-1227
ands	-1228
ced	-1229
▁large	-1230
()	-1231
▁Here	-1232
aut	-1233
▁below	-1234
ats	-1235
▁got	-1236
lf	-1237
▁while	-1238
▁repl	-1239
▁area	-1240
▁solution	-1241
▁visit	-1242
▁exp	-1243
stem	-1244
▁Also	-1245
gative	-1246
▁coins	-1247
▁equals	-1248
▁adjacent	-1249
▁question	-1250
▁Eng	-1251
▁met	-1252
▁been	-1253
▁year	-1254
▁comput	-1255
▁19	-1256
▁select	-1257
▁segments	-1258
▁appear	-1259
▁moment	-1260
▁But	-1261
▁short	-1262
▁board	-1263
▁(2,	-1264
▁English	-1265
18	-1266
▁optimal	-1267
▁student	-1268
▁solve	-1269
ject	-1270
▁assi	-1271
▁child	-1272
▁vi	-1273
ings	-1274
▁starts	-1275
▁impossible	-1276
▁allowed	-1277
▁just	-1278
▁group	-1279
▁valid	-1280
▁dep	-1281
▁made	-1282
44	-1283
#.	-1284
val	-1285
▁flo	-1286
▁located	-1287
▁ph	-1288
ersect	-1289
▁white	-1290
▁Since	-1291
ign	-1292
▁ser	-1293
oy	-1294
▁rows	-1295
▁assume	-1296
▁cent	-1297
▁don	-1298
▁dra	-1299
uck	-1300
▁happ	-1301
▁beaut	-1302
inary	-1303
▁inst	-1304
▁train	-1305
reasing	-1306
ward	-1307
ah	-1308
▁during	-1309
▁cons	-1310
ograph	-1311
▁becomes	-1312
▁types	-1313
ects	-1314
▁pres	-1315
▁ori	-1316
▁calculate	-1317
oses	-1318
▁give	-1319
▁mag	-1320
▁nodes	-1321
▁columns	-1322
gor	-1323
ages	-1324
ield	-1325
asets	-1326
▁abs	-1327
▁pict	-1328
▁power	-1329
▁cy	-1330
ithm	-1331
▁datasets	-1332
▁Petya	-1333
rees	-1334
35	-1335
▁&	-1336
▁fourth	-1337
▁whether	-1338
_#	-1339
bot	-1340
▁players	-1341
▁sk	-1342
▁smallest	-1343
ient	-1344
mat	-1345
way	-1346
▁seconds	-1347
▁trave	-1348
▁among	-1349
▁found	-1350
▁coordinate	-1351
gon	-1352
tern	-1353
▁ci	-1354
ible	-1355
▁representing	-1356
aced	-1357
▁shown	-1358
ittle	-1359
▁/	-1360
▁larg	-1361
▁problems	-1362
▁40	-1363
osen	-1364
▁had	-1365
▁Wh	-1366
▁assign	-1367
▁system	-1368
2)	-1369
▁5.	-1370
▁call	-1371
air	-1372
34	-1373
▁hold	-1374
ee	-1375
▁10^{	-1376
▁That	-1377
len	-1378
oks	-1379
xic	-1380
▁bott	-1381
▁chosen	-1382
▁beginning	-1383
ests	-1384
ert	-1385
▁?	-1386
side	-1387
co	-1388
▁intersect	-1389
▁Yes	-1390
▁spaces	-1391
▁indices	-1392
▁inclusive	-1393
20	-1394
ros	-1395
▁They	-1396
▁rest	-1397
▁denotes	-1398
▁house	-1399
xicograph	-1400
og	-1401
dd	-1402
▁probab	-1403
▁station	-1404
port	-1405
▁gen	-1406
▁vari	-1407
▁7.	-1408
▁dest	-1409
▁mess	-1410
▁contest	-1411
▁li	-1412
▁asked	-1413
▁going	-1414
▁sa	-1415
▁under	-1416
__	-1417
▁Ar	-1418
olute	-1419
▁consecut	-1420
▁--	-1421
▁Please	-1422
▁lexicograph	-1423
▁programm	-1424
▁see	-1425
▁town	-1426
▁minutes	-1427
▁inf	-1428
66	-1429
▁21	-1430
▁remaining	-1431
▁origin	-1432
NO	-1433
▁Che	-1434
▁sequences	-1435
▁Pro	-1436
▁interest	-1437
arr	-1438
▁cut	-1439
▁100)	-1440
▁block	-1441
ending	-1442
▁lead	-1443
▁And	-1444
▁absolute	-1445
ier	-1446
▁2)	-1447
▁piece	-1448
ls	-1449
ror	-1450
▁sort	-1451
▁colors	-1452
ored	-1453
100	-1454
,000	-1455
▁root	-1456
▁fe	-1457
ven	-1458
▁run	-1459
▁step	-1460
▁24	-1461
▁Un	-1462
aper	-1463
▁those	-1464
▁bus	-1465
ocks	-1466
▁water	-1467
oney	-1468
▁check	-1469
▁prime	-1470
▁sets	-1471
▁pieces	-1472
▁cap	-1473
▁upper	-1474
^{	-1475
line	-1476
▁binary	-1477
▁op	-1478
▁wal	-1479
ently	-1480
▁robot	-1481
▁obtained	-1482
--	-1483
ke	-1484
ording	-1485
▁10^5)	-1486
▁Ber	-1487
▁gets	-1488
▁real	-1489
▁ret	-1490
action	-1491
▁final	-1492
▁decimal	-1493
▁\\	-1494
unction	-1495
imit	-1496
▁field	-1497
ures	-1498
iss	-1499
mb	-1500
▁mark	-1501
▁23	-1502
▁wall	-1503
▁probability	-1504
ones	-1505
▁wins	-1506
▁picture	-1507
que	-1508
▁rul	-1509
▁money	-1510
▁remove	-1511
▁inv	-1512
▁nec	-1513
any	-1514
▁figure	-1515
▁special	-1516
ought	-1517
▁goes	-1518
67	-1519
▁shortest	-1520
fer	-1521
▁since	-1522
▁lab	-1523
aving	-1524
▁uni	-1525
▁cour	-1526
▁consecutive	-1527
▁6,	-1528
▁initially	-1529
▁ends	-1530
▁difference	-1531
imes	-1532
▁Chef	-1533
▁gives	-1534
red	-1535
▁express	-1536
▁again	-1537
1)	-1538
▁goal	-1539
▁6.	-1540
ross	-1541
▁much	-1542
negative	-1543
YES	-1544
▁knows	-1545
ster	-1546
▁stop	-1547
▁common	-1548
▁statement	-1549
▁return	-1550
day	-1551
▁22	-1552
▁floor	-1553
gy	-1554
▁along	-1555
set	-1556
▁polygon	-1557
▁look	-1558
▁subsequence	-1559
▁-1.	-1560
▁jum	-1561
▁remo	-1562
▁500	-1563
imize	-1564
empty	-1565
▁alph	-1566
▁class	-1567
........	-1568
aking	-1569
▁well	-1570
▁able	-1571
▁She	-1572
vious	-1573
▁hand	-1574
▁<=	-1575
▁hor	-1576
▁Z	-1577
▁simple	-1578
▁present	-1579
itially	-1580
14	-1581
▁whose	-1582
▁blocks	-1583
▁price	-1584
▁rules	-1585
cd	-1586
ink	-1587
▁blue	-1588
ift	-1589
▁code	-1590
3.	-1591
sider	-1592
▁belong	-1593
▁travel	-1594
▁cub	-1595
▁Thus	-1596
▁rectangle	-1597
asha	-1598
▁spe	-1599
ered	-1600
medi	-1601
▁Be	-1602
▁bre	-1603
ull	-1604
▁being	-1605
1}	-1606
▁gir	-1607
▁circle	-1608
▁incre	-1609
chie	-1610
▁sect	-1611
indrom	-1612
ination	-1613
▁stand	-1614
15	-1615
▁Initially	-1616
▁Figure	-1617
▁Consider	-1618
ule	-1619
▁1-	-1620
bitr	-1621
▁unt	-1622
wor	-1623
alindrom	-1624
6,	-1625
64	-1626
▁sl	-1627
▁^	-1628
▁tell	-1629
XX	-1630
▁arbitr	-1631
▁playing	-1632
▁resulting	-1633
ual	-1634
atin	-1635
arn	-1636
▁complete	-1637
▁(0,	-1638
▁100000	-1639
▁nor	-1640
▁brack	-1641
▁course	-1642
▁rot	-1643
▁strict	-1644
-1}	-1645
▁back	-1646
▁too	-1647
inite	-1648
urs	-1649
▁00	-1650
▁alphab	-1651
sib	-1652
ting	-1653
ivers	-1654
ches	-1655
nd	-1656
▁Two	-1657
▁plane	-1658
▁bottom	-1659
▁addition	-1660
omet	-1661
ucky	-1662
'.	-1663
▁Mr	-1664
▁\{	-1665
angu	-1666
mbol	-1667
fl	-1668
zz	-1669
ool	-1670
▁-3	-1671
▁gener	-1672
▁needed	-1673
▁minimal	-1674
82	-1675
▁cr	-1676
▁followed	-1677
▁units	-1678
▁candies	-1679
▁si	-1680
ying	-1681
ional	-1682
▁achie	-1683
▁necess	-1684
▁defined	-1685
rib	-1686
▁sn	-1687
oring	-1688
▁open	-1689
▁(3,	-1690
BB	-1691
gorithm	-1692
ication	-1693
ont	-1694
▁langu	-1695
▁draw	-1696
▁Every	-1697
▁triang	-1698
▁key	-1699
atch	-1700
▁ins	-1701
adi	-1702
▁swap	-1703
>.	-1704
▁lea	-1705
▁Latin	-1706
▁[2,	-1707
▁eas	-1708
▁range	-1709
▁until	-1710
ia	-1711
▁items	-1712
▁country	-1713
▁satisfies	-1714
icks	-1715
▁become	-1716
▁includ	-1717
▁strictly	-1718
OR	-1719
ighb	-1720
▁describe	-1721
AA	-1722
▁Berland	-1723
▁solutions	-1724
hn	-1725
▁paper	-1726
anks	-1727
▁1000000000	-1728
▁sign	-1729
▁match	-1730
▁32	-1731
▁own	-1732
▁term	-1733
▁likes	-1734
▁placed	-1735
sp	-1736
▁error	-1737
▁spend	-1738
idth	-1739
▁algorithm	-1740
▁original	-1741
·10	-1742
▁palindrom	-1743
▁unique	-1744
▁speed	-1745
1.	-1746
▁note	-1747
▁changes	-1748
▁pat	-1749
▁immedi	-1750
▁vers	-1751
▁≥	-1752
alle	-1753
tt	-1754
50	-1755
idd	-1756
most	-1757
_3	-1758
▁replace	-1759
work	-1760
board	-1761
▁fact	-1762
▁symbol	-1763
▁60	-1764
▁000)	-1765
▁neighb	-1766
ashi	-1767
▁unit	-1768
▁stones	-1769
▁largest	-1770
ape	-1771
▁moving	-1772
▁collect	-1773
ead	-1774
▁106	-1775
▁walk	-1776
32	-1777
▁trees	-1778
ton	-1779
▁eat	-1780
ful	-1781
tun	-1782
▁enough	-1783
`.	-1784
iful	-1785
▁shows	-1786
▁won	-1787
▁repe	-1788
▁(3	-1789
ness	-1790
▁asks	-1791
▁1000)	-1792
▁constraints	-1793
▁map	-1794
▁chooses	-1795
▁3)	-1796
izes	-1797
▁steps	-1798
ze	-1799
▁horiz	-1800
▁10^6	-1801
▁base	-1802
▁arrange	-1803
ai	-1804
▁teams	-1805
▁denote	-1806
▁ident	-1807
▁message	-1808
▁function	-1809
ffic	-1810
hing	-1811
▁1),	-1812
▁ext	-1813
▁still	-1814
▁expect	-1815
▁inside	-1816
▁tw	-1817
▁company	-1818
):	-1819
ased	-1820
▁zeros	-1821
▁home	-1822
▁divisible	-1823
2.	-1824
▁construct	-1825
▁7,	-1826
4)	-1827
▁spl	-1828
▁route	-1829
ilar	-1830
▁bit	-1831
▁shop	-1832
▁limit	-1833
ploy	-1834
▁hour	-1835
▁subset	-1836
▁Tak	-1837
▁26	-1838
▁subt	-1839
▁sur	-1840
▁What	-1841
▁according	-1842
▁beautiful	-1843
▁av	-1844
▁deg	-1845
▁produ	-1846
▁balls	-1847
2}	-1848
▁increasing	-1849
▁participants	-1850
30	-1851
▁Sh	-1852
▁painted	-1853
els	-1854
ized	-1855
▁magic	-1856
10^	-1857
acks	-1858
▁text	-1859
▁boxes	-1860
▁jump	-1861
))	-1862
bb	-1863
als	-1864
▁pack	-1865
▁names	-1866
▁paths	-1867
▁alphabet	-1868
▁---	-1869
▁arri	-1870
▁loves	-1871
▁mean	-1872
alf	-1873
▁arbitrary	-1874
▁questions	-1875
oo	-1876
▁More	-1877
▁sides	-1878
▁turns	-1879
▁create	-1880
po	-1881
▁bar	-1882
▁memb	-1883
▁parts	-1884
▁say	-1885
▁sit	-1886
ex	-1887
▁center	-1888
▁contin	-1889
▁island	-1890
▁Sn	-1891
▁odd	-1892
89	-1893
▁%	-1894
▁27	-1895
▁90	-1896
sibly	-1897
▁never	-1898
▁radi	-1899
▁having	-1900
pro	-1901
cept	-1902
▁opp	-1903
▁came	-1904
▁come	-1905
`,	-1906
▁Jo	-1907
▁lucky	-1908
ahashi	-1909
▁best	-1910
▁«	-1911
ane	-1912
▁known	-1913
▁light	-1914
tunately	-1915
elf	-1916
ders	-1917
here	-1918
andom	-1919
ian	-1920
▁infinite	-1921
▁immediately	-1922
16	-1923
▁cross	-1924
direct	-1925
▁clos	-1926
▁meet	-1927
omin	-1928
chool	-1929
▁tick	-1930
▁soldi	-1931
ockwise	-1932
▁itself	-1933
▁aa	-1934
▁pick	-1935
▁stra	-1936
ov	-1937
9999	-1938
▁pay	-1939
▁(10	-1940
...,	-1941
▁100000000	-1942
\}	-1943
cles	-1944
ertain	-1945
▁product	-1946
ics	-1947
ared	-1948
▁109)	-1949
▁file	-1950
▁width	-1951
▁divided	-1952
▁Takahashi	-1953
▁□	-1954
hip	-1955
▁Little	-1956
▁interval	-1957
ocol	-1958
▁programming	-1959
▁[3,	-1960
▁64	-1961
▁groups	-1962
▁el	-1963
▁king	-1964
▁strength	-1965
▁previous	-1966
);	-1967
77	-1968
cy	-1969
▁indicates	-1970
gg	-1971
pend	-1972
▁Problem	-1973
wik	-1974
▁define	-1975
▁exam	-1976
gan	-1977
▁lengths	-1978
▁substrings	-1979
5)	-1980
▁28	-1981
▁supp	-1982
▁arrays	-1983
ike	-1984
▁prof	-1985
▁paren	-1986
▁employ	-1987
▁lot	-1988
iness	-1989
▁expected	-1990
101	-1991
▁free	-1992
▁separ	-1993
7.	-1994
ood	-1995
amet	-1996
acher	-1997
▁random	-1998
▁record	-1999
▁bracket	-2000
imens	-2001
0.	-2002
incl	-2003
▁straight	-2004
▁Therefore	-2005
ty	-2006
cum	-2007
ually	-2008
▁occup	-2009
▁paralle	-2010
▁35	-2011
▁del	-2012
▁que	-2013
arily	-2014
25	-2015
self	-2016
▁apply	-2017
▁rooms	-2018
anged	-2019
▁105)	-2020
▁2000	-2021
......	-2022
uzz	-2023
▁0)	-2024
▁1).	-2025
7,	-2026
ontal	-2027
▁ones	-2028
▁whole	-2029
▁children	-2030
▁connecting	-2031
▁fav	-2032
rd	-2033
▁ax	-2034
order	-2035
▁chocol	-2036
▁300	-2037
▁appl	-2038
▁great	-2039
▁minute	-2040
uous	-2041
▁pile	-2042
▁computer	-2043
AB	-2044
eng	-2045
uke	-2046
▁makes	-2047
ib	-2048
▁ui	-2049
ily	-2050
right	-2051
econd	-2052
▁hig	-2053
omb	-2054
▁conc	-2055
▁wi	-2056
▁Lim	-2057
▁big	-2058
$.	-2059
▁Wr	-2060
ines	-2061
▁net	-2062
▁achieve	-2063
▁10,	-2064
▁cast	-2065
▁leading	-2066
▁1}	-2067
▁8,	-2068
19	-2069
ived	-2070
directed	-2071
▁-4	-2072
umber	-2073
▁relative	-2074
▁rectangular	-2075
▁independ	-2076
▁vertical	-2077
▁enc	-2078
▁certain	-2079
▁1:	-2080
▁sorted	-2081
▁teacher	-2082
ores	-2083
ustom	-2084
▁conf	-2085
▁cover	-2086
▁cle	-2087
▁comb	-2088
▁hard	-2089
▁suit	-2090
▁tiles	-2091
▁45	-2092
▁proper	-2093
▁participant	-2094
▁kind	-2095
▁intersection	-2096
iting	-2097
▁phot	-2098
▁break	-2099
▁pattern	-2100
▁dri	-2101
▁fam	-2102
▁object	-2103
uri	-2104
▁job	-2105
▁split	-2106
ery	-2107
▁Of	-2108
▁did	-2109
▁wond	-2110
▁These	-2111
▁horizontal	-2112
iod	-2113
▁subarr	-2114
▁particular	-2115
ody	-2116
▁school	-2117
22	-2118
arch	-2119
sword	-2120
▁Limak	-2121
▁selected	-2122
▁testcase	-2123
▁2-	-2124
▁book	-2125
▁instruct	-2126
▁remainder	-2127
000000	-2128
aba	-2129
▁attack	-2130
_#_#	-2131
▁compet	-2132
3)	-2133
▁printed	-2134
37	-2135
1111	-2136
▁world	-2137
No	-2138
▁($	-2139
over	-2140
▁bro	-2141
▁stations	-2142
17	-2143
iving	-2144
▁Val	-2145
▁10^9)	-2146
▁instead	-2147
65	-2148
my	-2149
▁reac	-2150
ills	-2151
▁10.	-2152
▁Form	-2153
play	-2154
thing	-2155
▁disc	-2156
▁half	-2157
cending	-2158
▁custom	-2159
▁finish	-2160
▁smaller	-2161
▁satisfied	-2162
ults	-2163
▁looks	-2164
ba	-2165
ha	-2166
▁coun	-2167
▁spell	-2168
▁within	-2169
ny	-2170
▁Snuke	-2171
▁expression	-2172
▁satisfying	-2173
ables	-2174
▁pref	-2175
▁prov	-2176
▁–	-2177
att	-2178
OI	-2179
▁Ai	-2180
▁tow	-2181
▁insert	-2182
▁corresponds	-2183
▁-5	-2184
▁cop	-2185
▁100,	-2186
▁longest	-2187
▁2),	-2188
▁appears	-2189
//	-2190
▁receive	-2191
▁weights	-2192
▁undirected	-2193
▁easy	-2194
▁puzz	-2195
▁games	-2196
sh	-2197
▁42	-2198
▁destro	-2199
▁building	-2200
▁girl	-2201
▁why	-2202
▁flow	-2203
▁five	-2204
▁Format	-2205
▁winner	-2206
▁connects	-2207
▁triangle	-2208
ature	-2209
▁optim	-2210
fortunately	-2211
ads	-2212
flush	-2213
less	-2214
umer	-2215
aur	-2216
ka	-2217
▁wa	-2218
▁5000	-2219
ptions	-2220
▁costs	-2221
$,	-2222
▁abc	-2223
ather	-2224
▁Case	-2225
cts	-2226
▁doll	-2227
▁fall	-2228
▁rememb	-2229
▁assigned	-2230
▁performed	-2231
60	-2232
ij	-2233
})	-2234
ital	-2235
▁radius	-2236
possibly	-2237
▁increase	-2238
ailable	-2239
▁import	-2240
80	-2241
▁network	-2242
icult	-2243
ouses	-2244
▁song	-2245
gether	-2246
▁indicated	-2247
▁little	-2248
▁Formally	-2249
▁holds	-2250
▁around	-2251
ima	-2252
▁event	-2253
van	-2254
▁vol	-2255
▁sent	-2256
▁store	-2257
▁distrib	-2258
▁maximal	-2259
▁results	-2260
▁language	-2261
ret	-2262
▁matter	-2263
▁Determine	-2264
▁interesting	-2265
▁accept	-2266
▁parent	-2267
▁la	-2268
velop	-2269
▁land	-2270
▁difficult	-2271
nt	-2272
▁“	-2273
arm	-2274
▁revers	-2275
#..	-2276
ark	-2277
▁$.	-2278
▁(1≤	-2279
▁divide	-2280
▁**	-2281
▁Some	-2282
▁determ	-2283
▁period	-2284
iversity	-2285
▁uppercase	-2286
xi	-2287
aken	-2288
▁press	-2289
84	-2290
^2	-2291
uth	-2292
ament	-2293
times	-2294
▁added	-2295
▁section	-2296
lex	-2297
uation	-2298
85	-2299
://	-2300
▁John	-2301
▁docum	-2302
▁transform	-2303
87	-2304
▁palindrome	-2305
lo	-2306
oth	-2307
▁ener	-2308
▁domin	-2309
asks	-2310
▁permutations	-2311
▁1]	-2312
▁Can	-2313
▁stone	-2314
Yes	-2315
ams	-2316
▁9.	-2317
▁bag	-2318
▁guess	-2319
▁together	-2320
▁$,	-2321
▁leaves	-2322
24	-2323
[1	-2324
▁button	-2325
▁bal	-2326
▁six	-2327
acing	-2328
▁planet	-2329
▁started	-2330
13	-2331
▁delet	-2332
69	-2333
ances	-2334
▁minimize	-2335
▁available	-2336
▁directions	-2337
era	-2338
▁80	-2339
▁dev	-2340
▁trip	-2341
▁stack	-2342
assword	-2343
▁parallel	-2344
na	-2345
com	-2346
8,	-2347
▁high	-2348
▁2:	-2349
onent	-2350
▁rank	-2351
▁send	-2352
▁sizes	-2353
▁expl	-2354
▁here	-2355
orts	-2356
▁tem	-2357
▁During	-2358
▁blanks	-2359
▁energy	-2360
▁changed	-2361
▁By	-2362
▁{1,	-2363
jects	-2364
▁important	-2365
▁Le	-2366
▁hero	-2367
▁prefix	-2368
▁monster	-2369
▁optimally	-2370
>,	-2371
▁2^	-2372
▁might	-2373
▁describing	-2374
lt	-2375
▁Se	-2376
▁[1	-2377
alen	-2378
▁101	-2379
▁sure	-2380
▁password	-2381
▁pur	-2382
be	-2383
ifth	-2384
▁enem	-2385
▁places	-2386
▁descriptions	-2387
▁34	-2388
agon	-2389
atur	-2390
aver	-2391
▁-10	-2392
▁mach	-2393
▁learn	-2394
▁organ	-2395
idi	-2396
ains	-2397
▁cycle	-2398
▁beauty	-2399
ites	-2400
▁sell	-2401
▁divisor	-2402
▁Am	-2403
▁exper	-2404
▁........	-2405
▁fix	-2406
▁succ	-2407
▁Write	-2408
▁fifth	-2409
▁location	-2410
▁soldiers	-2411
▁correspondingly	-2412
-1,	-2413
ode	-2414
▁marked	-2415
▁separate	-2416
ows	-2417
▁candid	-2418
▁occurs	-2419
▁interested	-2420
me	-2421
▁)	-2422
▁fight	-2423
bs	-2424
ric	-2425
▁::	-2426
inks	-2427
▁destroy	-2428
▁display	-2429
▁standing	-2430
▁destination	-2431
▁meters	-2432
▁8.	-2433
▁old	-2434
▁33	-2435
▁super	-2436
▁taken	-2437
▁delete	-2438
▁except	-2439
▁identif	-2440
▁occurren	-2441
▁Unfortunately	-2442
fe	-2443
▁"1	-2444
▁door	-2445
▁queue	-2446
▁front	-2447
▁stands	-2448
###	-2449
▁lit	-2450
▁pri	-2451
▁himself	-2452
▁9,	-2453
▁Sub	-2454
▁log	-2455
▁away	-2456
▁favor	-2457
▁formed	-2458
ana	-2459
4435	-2460
gment	-2461
▁representation	-2462
abc	-2463
▁2]	-2464
▁Com	-2465
▁Second	-2466
▁strate	-2467
▁command	-2468
345	-2469
▁full	-2470
▁swit	-2471
rac	-2472
824435	-2473
▁leave	-2474
▁houses	-2475
hess	-2476
vert	-2477
▁cubes	-2478
▁green	-2479
▁twice	-2480
▁directed	-2481
▁(4,	-2482
▁exit	-2483
▁develop	-2484
▁outputs	-2485
min	-2486
▁park	-2487
90	-2488
dom	-2489
____	-2490
▁King	-2491
▁main	-2492
▁hours	-2493
▁tourn	-2494
▁arranged	-2495
mm	-2496
ken	-2497
▁rule	-2498
▁109).	-2499
▁flush	-2500
▁lay	-2501
▁user	-2502
▁image	-2503
▁shape	-2504
▁share	-2505
▁miss	-2506
▁necessary	-2507
-1)	-2508
▁Rec	-2509
▁pot	-2510
▁received	-2511
sid	-2512
▁De	-2513
▁swe	-2514
iding	-2515
illed	-2516
▁enter	-2517
▁describes	-2518
▁⊕	-2519
uff	-2520
ience	-2521
▁100).	-2522
▁specified	-2523
****	-2524
ished	-2525
uration	-2526
ole	-2527
oday	-2528
▁somet	-2529
▁my	-2530
▁prep	-2531
▁tile	-2532
▁watch	-2533
▁currently	-2534
RR	-2535
▁tasks	-2536
ists	-2537
that	-2538
▁ang	-2539
idden	-2540
▁thus	-2541
▁actions	-2542
▁request	-2543
▁cat	-2544
▁isn	-2545
▁yet	-2546
▁decre	-2547
▁termin	-2548
hemat	-2549
▁candy	-2550
▁colored	-2551
▁36	-2552
▁boy	-2553
▁formul	-2554
▁favorite	-2555
▁fi	-2556
▁restaur	-2557
▁directly	-2558
40	-2559
|.	-2560
man	-2561
1010	-2562
ract	-2563
▁chess	-2564
▁puzzle	-2565
▁counter	-2566
▁symbols	-2567
ja	-2568
---	-2569
▁Today	-2570
▁books	-2571
▁arrangement	-2572
ron	-2573
▁dr	-2574
▁else	-2575
▁fore	-2576
??	-2577
ilt	-2578
▁AB	-2579
fect	-2580
▁Dima	-2581
▁month	-2582
▁ascending	-2583
▁chocolate	-2584
▁‘	-2585
▁99824435	-2586
▁stay	-2587
▁comes	-2588
▁corner	-2589
▁tournament	-2590
▁subsequences	-2591
▁treas	-2592
▁turned	-2593
▁paramet	-2594
ees	-2595
ention	-2596
▁Su	-2597
▁said	-2598
▁conve	-2599
▁zeroes	-2600
▁suitable	-2601
92	-2602
▁01	-2603
▁70	-2604
▁mem	-2605
▁meaning	-2606
olog	-2607
▁yen	-2608
wards	-2609
itions	-2610
▁bought	-2611
abb	-2612
ops	-2613
▁3),	-2614
ource	-2615
▁north	-2616
br	-2617
▁XOR	-2618
▁bul	-2619
ously	-2620
left	-2621
sters	-2622
▁2·10	-2623
▁cook	-2624
▁gave	-2625
oes	-2626
▁larger	-2627
▁played	-2628
dec	-2629
▁"0	-2630
ution	-2631
▁####	-2632
▁prefer	-2633
▁nothing	-2634
▁regular	-2635
▁maximize	-2636
▁negative	-2637
imensional	-2638
▁independent	-2639
IN	-2640
▁hu	-2641
▁0.5	-2642
▁pix	-2643
▁10^5.	-2644
▁keep	-2645
▁denoted	-2646
▁similar	-2647
▁rectangles	-2648
*.	-2649
gt	-2650
ume	-2651
▁ear	-2652
to	-2653
▁((	-2654
aten	-2655
▁ship	-2656
▁summ	-2657
forces	-2658
▁coinc	-2659
▁marks	-2660
▁removed	-2661
▁pop	-2662
▁cout	-2663
▁post	-2664
▁10^5,	-2665
▁underst	-2666
▁version	-2667
▁necessarily	-2668
▁party	-2669
▁years	-2670
▁specifier	-2671
ova	-2672
▁capital	-2673
edia	-2674
▁brid	-2675
▁stage	-2676
▁3-	-2677
▁Re	-2678
▁Sim	-2679
▁soon	-2680
▁better	-2681
}{	-2682
▁tar	-2683
▁Ivan	-2684
▁105).	-2685
▁≦	-2686
▁000,	-2687
▁chip	-2688
▁clockwise	-2689
55	-2690
▁gl	-2691
▁members	-2692
rol	-2693
▁tank	-2694
fficient	-2695
▁machine	-2696
▁subarray	-2697
mp	-2698
▁1≤	-2699
dots	-2700
▁few	-2701
itting	-2702
ultane	-2703
▁happen	-2704
.,	-2705
▁ki	-2706
▁Test	-2707
▁built	-2708
▁towns	-2709
▁simultane	-2710
▁food	-2711
▁ref	-2712
▁think	-2713
▁making	-2714
▁really	-2715
▁require	-2716
▁100.	-2717
iction	-2718
aw	-2719
ney	-2720
oss	-2721
▁4)	-2722
▁cars	-2723
▁love	-2724
▁street	-2725
(1	-2726
0)	-2727
iew	-2728
▁$1	-2729
▁fun	-2730
▁uses	-2731
▁matches	-2732
▁success	-2733
][	-2734
▁3]	-2735
span	-2736
▁jud	-2737
▁head	-2738
▁const	-2739
▁action	-2740
▁contained	-2741
4.	-2742
PC	-2743
hest	-2744
▁Ver	-2745
where	-2746
▁bad	-2747
▁sched	-2748
▁situation	-2749
▁1000000007	-2750
ency	-2751
▁cube	-2752
▁occur	-2753
▁shift	-2754
▁His	-2755
▁hack	-2756
▁ticket	-2757
ci	-2758
▁our	-2759
osing	-2760
▁army	-2761
▁Vertex	-2762
▁circles	-2763
LL	-2764
ins	-2765
rop	-2766
▁29	-2767
▁try	-2768
uding	-2769
▁took	-2770
▁strategy	-2771
reen	-2772
▁Mon	-2773
|,	-2774
anc	-2775
uce	-2776
▁pip	-2777
cases	-2778
▁enemy	-2779
▁inputs	-2780
ser	-2781
ury	-2782
▁cake	-2783
▁east	-2784
▁report	-2785
inclusive	-2786
▁specific	-2787
of	-2788
mit	-2789
▁bomb	-2790
▁1,000	-2791
▁happy	-2792
▁belongs	-2793
75	-2794
111	-2795
▁0.0	-2796
▁extra	-2797
▁loses	-2798
▁Valera	-2799
▁Polycarpus	-2800
▁simultaneously	-2801
ale	-2802
▁7).	-2803
▁depart	-2804
▁performing	-2805
74	-2806
_{1,	-2807
etic	-2808
▁art	-2809
▁cycl	-2810
▁events	-2811
▁rotate	-2812
▁formally	-2813
oon	-2814
▁31	-2815
▁deck	-2816
▁Beaver	-2817
."	-2818
body	-2819
▁Tar	-2820
▁Vova	-2821
▁search	-2822
▁recently	-2823
▁meth	-2824
▁rating	-2825
▁secret	-2826
unctions	-2827
▁heights	-2828
▁passeng	-2829
ND	-2830
oid	-2831
ude	-2832
▁es	-2833
▁oppos	-2834
▁perfect	-2835
70	-2836
=[	-2837
_{2	-2838
ior	-2839
▁Both	-2840
▁sticks	-2841
$-	-2842
/2	-2843
ug	-2844
▁Do	-2845
▁hit	-2846
▁degree	-2847
▁complet	-2848
airs	-2849
▁fast	-2850
000000000	-2851
▁division	-2852
ited	-2853
ries	-2854
▁110	-2855
▁Cre	-2856
▁sho	-2857
ators	-2858
=1	-2859
htt	-2860
▁55	-2861
▁Sp	-2862
▁bur	-2863
▁robo	-2864
iguous	-2865
ipedia	-2866
straint	-2867
▁execut	-2868
▁ordered	-2869
aps	-2870
ffect	-2871
▁west	-2872
▁manag	-2873
▁piles	-2874
▁stops	-2875
▁Number	-2876
▁struct	-2877
▁subtree	-2878
sume	-2879
▁robots	-2880
▁movement	-2881
uc	-2882
:00	-2883
▁JOI	-2884
coordin	-2885
▁method	-2886
▁getting	-2887
▁document	-2888
pr	-2889
plic	-2890
▁64-	-2891
▁true	-2892
▁tests	-2893
23	-2894
CD	-2895
▁ID	-2896
lock	-2897
▁cin	-2898
▁done	-2899
▁overl	-2900
▁arithm	-2901
())	-2902
ific	-2903
▁war	-2904
asure	-2905
▁exch	-2906
▁solved	-2907
▁visited	-2908
▁calculated	-2909
osed	-2910
▁[4,	-2911
▁page	-2912
▁self	-2913
▁lives	-2914
▁choice	-2915
▁air	-2916
anced	-2917
▁created	-2918
▁mathemat	-2919
org	-2920
stac	-2921
▁low	-2922
▁elect	-2923
problem	-2924
21	-2925
ten	-2926
rote	-2927
▁elev	-2928
▁rail	-2929
▁rock	-2930
9,	-2931
wh	-2932
▁Is	-2933
alth	-2934
room	-2935
▁gift	-2936
▁lost	-2937
▁wind	-2938
▁notes	-2939
▁finally	-2940
▁variable	-2941
_0	-2942
ox	-2943
uel	-2944
▁fixed	-2945
▁config	-2946
▁degrees	-2947
▁repeated	-2948
▁completely	-2949
col	-2950
▁(-	-2951
▁4]	-2952
▁jo	-2953
apan	-2954
▁From	-2955
▁vill	-2956
▁tower	-2957
▁formula	-2958
0000000000	-2959
dimensional	-2960
ustr	-2961
▁dice	-2962
▁numer	-2963
▁wrote	-2964
0000000	-2965
++.	-2966
cise	-2967
▁endpo	-2968
▁finds	-2969
▁String	-2970
▁obstac	-2971
▁office	-2972
▁fraction	-2973
3333	-2974
▁working	-2975
+2	-2976
ek	-2977
imet	-2978
▁rearr	-2979
▁desired	-2980
▁concaten	-2981
+1}	-2982
▁bound	-2983
dict	-2984
▁none	-2985
▁entire	-2986
▁1000000	-2987
ald	-2988
▁0).	-2989
▁plays	-2990
▁target	-2991
▁anything	-2992
▁greatest	-2993
▁programmer	-2994
ife	-2995
▁44	-2996
▁Ele	-2997
▁[0,	-2998
▁grow	-2999
▁vect	-3000
▁Sasha	-3001
▁volume	-3002
▁compute	-3003
▁commands	-3004
▁customer	-3005
▁employee	-3006
95	-3007
ger	-3008
mon	-3009
▁Sm	-3010
▁dam	-3011
▁begins	-3012
▁rooted	-3013
▁monsters	-3014
hi	-3015
amed	-3016
▁memory	-3017
▁occupied	-3018
_1$	-3019
▁works	-3020
▁orders	-3021
▁profit	-3022
▁scient	-3023
▁magical	-3024
▁included	-3025
zer	-3026
wiki	-3027
iddle	-3028
▁(109	-3029
AC	-3030
▁!	-3031
con	-3032
urther	-3033
▁deliv	-3034
▁throw	-3035
wikipedia	-3036
▁requests	-3037
▁standard	-3038
88	-3039
▁treasure	-3040
mod	-3041
▁Pl	-3042
▁pan	-3043
▁Taro	-3044
MM	-3045
(1,	-3046
▁mer	-3047
▁10^9+	-3048
▁photo	-3049
▁quite	-3050
ression	-3051
▁thinks	-3052
[2	-3053
CPC	-3054
rew	-3055
▁0),	-3056
▁ill	-3057
▁gold	-3058
▁stick	-3059
iset	-3060
▁didn	-3061
▁earn	-3062
▁winning	-3063
▁languages	-3064
_4	-3065
▁coll	-3066
ST	-3067
ails	-3068
irth	-3069
ister	-3070
▁Japan	-3071
▁altern	-3072
▁levels	-3073
▁notation	-3074
▁Hence	-3075
▁closed	-3076
▁restaurant	-3077
neq	-3078
leep	-3079
read	-3080
▁2).	-3081
▁1000,	-3082
▁defin	-3083
5.	-3084
https	-3085
▁plans	-3086
▁member	-3087
▁region	-3088
▁changing	-3089
lld	-3090
▁care	-3091
▁stri	-3092
oles	-3093
ality	-3094
ouble	-3095
▁others	-3096
▁Ad	-3097
ceed	-3098
▁scores	-3099
▁multiset	-3100
▁removing	-3101
▁including	-3102
..............	-3103
+1)	-3104
▁"(	-3105
▁aj	-3106
ched	-3107
▁cup	-3108
▁activ	-3109
▁counted	-3110
▁highest	-3111
79	-3112
▁fre	-3113
▁Create	-3114
▁apples	-3115
▁decide	-3116
▁diagon	-3117
▁determined	-3118
=2	-3119
](	-3120
▁went	-3121
▁occurrences	-3122
DD	-3123
aj	-3124
▁yes	-3125
▁entr	-3126
▁jour	-3127
▁arrow	-3128
▁capac	-3129
▁carry	-3130
▁reverse	-3131
▁subject	-3132
▁arithmetic	-3133
▁competition	-3134
▁neighboring	-3135
39	-3136
ems	-3137
ted	-3138
ifts	-3139
▁held	-3140
▁sheet	-3141
▁divisors	-3142
▁structure	-3143
▁indicating	-3144
\},	-3145
tect	-3146
▁[5,	-3147
ldots	-3148
▁quick	-3149
▁factor	-3150
decreasing	-3151
▁Tr	-3152
▁far	-3153
▁pen	-3154
▁Once	-3155
▁.....	-3156
▁chain	-3157
▁touch	-3158
45	-3159
▁dish	-3160
▁birth	-3161
▁disapp	-3162
ele	-3163
pon	-3164
▁anc	-3165
▁higher	-3166
.)	-3167
ires	-3168
▁105,	-3169
▁face	-3170
▁roll	-3171
▁depth	-3172
▁wrong	-3173
▁middle	-3174
▁trying	-3175
62	-3176
▁}	-3177
▁Cal	-3178
▁ide	-3179
avers	-3180
▁purch	-3181
rog	-3182
▁det	-3183
▁scen	-3184
▁preferred	-3185
▁assignment	-3186
-2	-3187
(2)	-3188
10,	-3189
cks	-3190
▁ca	-3191
▁4),	-3192
▁Cho	-3193
▁medi	-3194
▁seats	-3195
▁interact	-3196
▁pairwise	-3197
▁->	-3198
▁meets	-3199
▁today	-3200
▁convex	-3201
ER	-3202
bl	-3203
ends	-3204
▁111	-3205
▁bring	-3206
▁passes	-3207
▁3:	-3208
▁axis	-3209
▁lock	-3210
▁series	-3211
▁testcases	-3212
▁understand	-3213
▁hi	-3214
▁-1,	-3215
▁3000	-3216
▁Sere	-3217
▁bitwise	-3218
▁flowers	-3219
▁schedule	-3220
kn	-3221
pe	-3222
xx	-3223
ony	-3224
anya	-3225
▁Mike	-3226
▁leaf	-3227
▁source	-3228
▁taking	-3229
▁Recently	-3230
▁(|	-3231
▁outside	-3232
▁accepted	-3233
▁elevator	-3234
▁employees	-3235
▁subsegment	-3236
▁Sc	-3237
aaaa	-3238
dout	-3239
▁adv	-3240
▁ful	-3241
▁prog	-3242
▁angle	-3243
▁reaches	-3244
no	-3245
ners	-3246
▁upd	-3247
▁flip	-3248
▁maze	-3249
▁encry	-3250
▁temper	-3251
▁Similar	-3252
▁dollars	-3253
▁examples	-3254
▁instructions	-3255
6.	-3256
8.	-3257
▁Bes	-3258
▁lamp	-3259
▁proced	-3260
▁rounds	-3261
nce	-3262
▁Fin	-3263
▁near	-3264
▁mount	-3265
▁skill	-3266
▁10^{18	-3267
▁sweets	-3268
inations	-3269
▁however	-3270
▁partition	-3271
az	-3272
▁Mish	-3273
▁jury	-3274
verage	-3275
▁invers	-3276
▁tickets	-3277
▁training	-3278
li	-3279
▁∈	-3280
6666	-3281
▁150	-3282
▁Ste	-3283
▁1018	-3284
▁Supp	-3285
▁live	-3286
▁label	-3287
▁phone	-3288
▁commun	-3289
▁please	-3290
▁equation	-3291
\{	-3292
999	-3293
▁120	-3294
under	-3295
▁fill	-3296
▁Masha	-3297
▁regard	-3298
▁opposite	-3299
max	-3300
▁'0	-3301
▁est	-3302
▁drawn	-3303
_#_#_#_#	-3304
▁covered	-3305
▁reached	-3306
▁sections	-3307
▁1;	-3308
▁ap	-3309
▁1],	-3310
▁esc	-3311
▁Alex	-3312
▁\{1,	-3313
▁fuel	-3314
▁mode	-3315
▁10^4)	-3316
▁wanted	-3317
CC	-3318
_3,	-3319
▁Ko	-3320
itor	-3321
▁999	-3322
▁cou	-3323
▁mir	-3324
▁Choose	-3325
peration	-3326
▁Similarly	-3327
▁additional	-3328
by	-3329
▁mi	-3330
ully	-3331
▁.#.	-3332
ented	-3333
▁moved	-3334
▁Sereja	-3335
▁castle	-3336
▁switch	-3337
▁coincide	-3338
")	-3339
zy	-3340
-..	-3341
▁4-	-3342
zero	-3343
▁2^{	-3344
▁clar	-3345
▁snake	-3346
idirect	-3347
ization	-3348
▁Calcul	-3349
▁wonder	-3350
▁replaced	-3351
▁998244353.	-3352
▁contiguous	-3353
▁Te	-3354
itiz	-3355
▁Max	-3356
▁ign	-3357
▁kid	-3358
▁safe	-3359
▁hidden	-3360
▁dividing	-3361
▁increases	-3362
ber	-3363
▁Di	-3364
▁view	-3365
▁design	-3366
▁.......	-3367
▁measure	-3368
▁multipl	-3369
▁birthday	-3370
▁happiness	-3371
yr	-3372
cel	-3373
lya	-3374
omial	-3375
▁batt	-3376
▁1000).	-3377
The	-3378
uit	-3379
▁'1	-3380
▁400	-3381
▁kil	-3382
.....	-3383
▁109,	-3384
▁foot	-3385
▁fulf	-3386
▁night	-3387
▁10^5).	-3388
▁journey	-3389
▁overlap	-3390
CM	-3391
use	-3392
ason	-3393
▁sal	-3394
anger	-3395
ishes	-3396
phant	-3397
▁chef	-3398
▁decides	-3399
▁operator	-3400
▁##	-3401
axis	-3402
frac	-3403
lves	-3404
▁leg	-3405
▁blank	-3406
▁reads	-3407
▁running	-3408
clockwise	-3409
ON	-3410
▁123	-3411
▁hands	-3412
▁walls	-3413
▁constant	-3414
▁#.	-3415
name	-3416
▁bank	-3417
atural	-3418
▁areas	-3419
▁track	-3420
▁adding	-3421
▁Suppose	-3422
▁planets	-3423
ko	-3424
ava	-3425
▁(4	-3426
▁pn	-3427
▁106)	-3428
▁huge	-3429
strict	-3430
▁liters	-3431
▁screen	-3432
▁average	-3433
▁kingdom	-3434
▁solving	-3435
▁capacity	-3436
II	-3437
gre	-3438
▁Ark	-3439
▁ice	-3440
alent	-3441
▁keys	-3442
▁mist	-3443
▁south	-3444
ational	-3445
▁device	-3446
▁dishes	-3447
ype	-3448
yth	-3449
▁5)	-3450
▁calls	-3451
▁citiz	-3452
▁reading	-3453
imin	-3454
▁appe	-3455
▁forward	-3456
▁streams	-3457
▁bidirect	-3458
\}.	-3459
▁3).	-3460
fully	-3461
▁Subt	-3462
▁mass	-3463
▁health	-3464
▁messages	-3465
▁Calculate	-3466
▁university	-3467
▁lie	-3468
▁math	-3469
▁minim	-3470
▁cycles	-3471
▁knight	-3472
▁address	-3473
▁applied	-3474
▁thought	-3475
▁something	-3476
▁collection	-3477
kl	-3478
▁−	-3479
bles	-3480
▁gar	-3481
ecause	-3482
▁doors	-3483
▁10^9+7.	-3484
cal	-3485
ral	-3486
▁AA	-3487
echn	-3488
▁rub	-3489
▁xor	-3490
▁fire	-3491
▁doing	-3492
▁resid	-3493
▁forest	-3494
▁project	-3495
▁subsets	-3496
▁writing	-3497
▁entrance	-3498
▁leftmost	-3499
72	-3500
▁∑	-3501
▁puts	-3502
▁maxim	-3503
▁forget	-3504
▁ground	-3505
▁strong	-3506
▁strange	-3507
▁balanced	-3508
def	-3509
▁club	-3510
orrect	-3511
▁later	-3512
▁things	-3513
including	-3514
ey	-3515
iel	-3516
▁Im	-3517
▁"-1	-3518
▁2],	-3519
▁Any	-3520
ested	-3521
known	-3522
lects	-3523
▁cats	-3524
▁hole	-3525
▁stat	-3526
▁named	-3527
▁Arkady	-3528
▁lowest	-3529
▁scenari	-3530
▁correctly	-3531
')	-3532
="	-3533
AT	-3534
RA	-3535
io	-3536
▁54	-3537
▁Ro	-3538
▁aut	-3539
▁modif	-3540
▁applying	-3541
->	-3542
36	-3543
9.	-3544
▁■	-3545
▁Sy	-3546
▁ann	-3547
▁kinds	-3548
▁manner	-3549
▁median	-3550
▁continue	-3551
▁indicate	-3552
▁procedure	-3553
▁University	-3554
▁Qu	-3555
▁With	-3556
▁server	-3557
▁experim	-3558
▁quickly	-3559
▁candidate	-3560
76	-3561
ina	-3562
▁beh	-3563
34567	-3564
▁Igor	-3565
▁Step	-3566
▁bits	-3567
▁week	-3568
38	-3569
2),	-3570
▁("	-3571
aste	-3572
iced	-3573
unch	-3574
▁bear	-3575
▁lies	-3576
▁10^9).	-3577
▁became	-3578
▁states	-3579
▁writes	-3580
▁entered	-3581
▁indexes	-3582
▁popular	-3583
▁Moreover	-3584
▁everyone	-3585
▁identical	-3586
ms	-3587
}).	-3588
▁Ke	-3589
AAAA	-3590
▁Acc	-3591
essor	-3592
▁defe	-3593
nomial	-3594
▁fence	-3595
▁choosing	-3596
▁relations	-3597
▁XX	-3598
10^9	-3599
▁50)	-3600
▁transport	-3601
izz	-3602
▁Gr	-3603
gons	-3604
lymp	-3605
▁Ger	-3606
▁New	-3607
▁arc	-3608
▁pow	-3609
▁State	-3610
▁girls	-3611
▁Assume	-3612
▁border	-3613
▁famous	-3614
▁against	-3615
▁convert	-3616
enty	-3617
▁fit	-3618
▁seat	-3619
▁triple	-3620
▁brackets	-3621
coordinate	-3622
▁xn	-3623
swer	-3624
itted	-3625
▁ring	-3626
▁clear	-3627
▁distances	-3628
▁configuration	-3629
1},	-3630
sist	-3631
▁20.	-3632
▁sun	-3633
▁curs	-3634
▁nice	-3635
▁obser	-3636
▁corrid	-3637
▁remember	-3638
▁Bl	-3639
ming	-3640
▁104	-3641
▁subm	-3642
incess	-3643
onents	-3644
▁sleep	-3645
▁islands	-3646
▁wonders	-3647
▁49	-3648
mmet	-3649
▁011	-3650
atter	-3651
ision	-3652
▁cond	-3653
▁apple	-3654
▁swaps	-3655
underline	-3656
SS	-3657
WW	-3658
ply	-3659
▁Pr	-3660
ling	-3661
oder	-3662
▁Aiz	-3663
▁App	-3664
▁Rem	-3665
▁Ser	-3666
▁mor	-3667
arden	-3668
▁bars	-3669
▁rese	-3670
▁drink	-3671
▁polynomial	-3672
)=	-3673
cr	-3674
equ	-3675
▁75	-3676
▁ve	-3677
XXXX	-3678
▁1},	-3679
▁animal	-3680
▁burles	-3681
▁bidirectional	-3682
▁pol	-3683
▁date	-3684
▁eats	-3685
▁kill	-3686
▁routes	-3687
▁though	-3688
▁natural	-3689
▁exchange	-3690
▁printing	-3691
▁temperature	-3692
osh	-3693
face	-3694
▁coe	-3695
▁due	-3696
▁frog	-3697
▁suff	-3698
▁Among	-3699
▁plant	-3700
▁999999	-3701
▁charge	-3702
▁painting	-3703
jo	-3704
ged	-3705
▁11,	-3706
▁Its	-3707
▁Four	-3708
▁excl	-3709
gments	-3710
▁close	-3711
▁produce	-3712
▁pictures	-3713
▁According	-3714
▁С	-3715
▁Dr	-3716
▁OR	-3717
▁ak	-3718
arth	-3719
▁hum	-3720
▁Code	-3721
▁brother	-3722
▁junctions	-3723
29	-3724
<=	-3725
▁37	-3726
ense	-3727
▁(5,	-3728
▁cnt	-3729
ellow	-3730
▁frequ	-3731
▁stars	-3732
▁damage	-3733
▁pixels	-3734
▁assumed	-3735
▁remains	-3736
▁variables	-3737
▁continuous	-3738
NA	-3739
\;	-3740
_0,	-3741
▁[2	-3742
▁\;	-3743
▁bj	-3744
code	-3745
sequ	-3746
ties	-3747
▁plat	-3748
▁Peter	-3749
▁While	-3750
.......	-3751
▁bridge	-3752
▁prices	-3753
▁trains	-3754
▁mention	-3755
▁parameters	-3756
ahub	-3757
rist	-3758
arrow	-3759
▁told	-3760
▁Iahub	-3761
▁appro	-3762
▁based	-3763
▁across	-3764
▁dimens	-3765
▁completed	-3766
▁endpoints	-3767
oud	-3768
#...	-3769
2...	-3770
▁($1	-3771
▁10^4	-3772
▁busy	-3773
▁mill	-3774
▁visits	-3775
$)	-3776
▁men	-3777
aught	-3778
▁guard	-3779
▁cursor	-3780
▁platform	-3781
▁rearrange	-3782
▁instruction	-3783
;&	-3784
rod	-3785
▁5]	-3786
eled	-3787
ised	-3788
▁10-	-3789
▁Rep	-3790
▁ith	-3791
agram	-3792
▁link	-3793
▁lights	-3794
▁illustr	-3795
▁learned	-3796
▁restore	-3797
▁provided	-3798
▁subproblem	-3799
alk	-3800
▁47	-3801
▁gcd	-3802
▁pup	-3803
▁vide	-3804
apping	-3805
▁passed	-3806
▁sitting	-3807
▁definition	-3808
af	-3809
▁48	-3810
from	-3811
▁3],	-3812
▁cur	-3813
▁sums	-3814
▁trad	-3815
anging	-3816
▁disco	-3817
▁techn	-3818
▁Andrew	-3819
▁finding	-3820
▁happens	-3821
▁requires	-3822
+3	-3823
YY	-3824
▁bn	-3825
acci	-3826
▁City	-3827
▁Line	-3828
output	-3829
▁clean	-3830
_2,...,	-3831
▁skills	-3832
▁indexed	-3833
▁morning	-3834
▁decrease	-3835
▁receives	-3836
ki	-3837
▁vac	-3838
ected	-3839
▁eval	-3840
▁lose	-3841
▁wait	-3842
onacci	-3843
umbers	-3844
▁Smart	-3845
▁shuff	-3846
ilities	-3847
▁Finally	-3848
▁Subtask	-3849
▁Elephant	-3850
▁requirements	-3851
bc	-3852
1011	-3853
ison	-3854
pped	-3855
ried	-3856
▁12,	-3857
▁Des	-3858
ended	-3859
ident	-3860
quare	-3861
▁Mana	-3862
▁garden	-3863
▁candidates	-3864
▁constructed	-3865
ern	-3866
▁108	-3867
▁Not	-3868
▁sto	-3869
▁tax	-3870
acaba	-3871
▁ICPC	-3872
▁chose	-3873
SC	-3874
+1,	-3875
ese	-3876
ubl	-3877
▁Cl	-3878
_{2,	-3879
more	-3880
▁deal	-3881
▁skip	-3882
▁tries	-3883
▁conven	-3884
▁cyclic	-3885
▁spends	-3886
▁prepare	-3887
uced	-3888
▁cow	-3889
▁mov	-3890
round	-3891
▁Java	-3892
▁Only	-3893
▁fold	-3894
▁mind	-3895
▁wire	-3896
▁Manao	-3897
▁family	-3898
▁diction	-3899
28	-3900
EF	-3901
tons	-3902
▁fan	-3903
▁drive	-3904
▁gover	-3905
▁thing	-3906
ability	-3907
▁Before	-3908
▁passing	-3909
▁surface	-3910
▁products	-3911
lad	-3912
▁'.	-3913
▁59	-3914
▁65	-3915
▁tun	-3916
color	-3917
▁anal	-3918
▁catch	-3919
▁hence	-3920
▁filled	-3921
▁listed	-3922
▁living	-3923
▁100,000	-3924
▁noticed	-3925
▁instance	-3926
▁1,000,000	-3927
▁expressed	-3928
▁chessboard	-3929
▁distribute	-3930
3}	-3931
AG	-3932
ili	-3933
▁74	-3934
▁'0'	-3935
▁1].	-3936
anges	-3937
atures	-3938
▁jumps	-3939
▁quant	-3940
▁Gerald	-3941
▁battle	-3942
▁towers	-3943
▁mission	-3944
▁dominoes	-3945
▁opponent	-3946
▁component	-3947
▁difficulty	-3948
(1)	-3949
-1.	-3950
uts	-3951
▁Me	-3952
apes	-3953
▁Min	-3954
▁eng	-3955
▁snow	-3956
▁unus	-3957
▁forms	-3958
▁shall	-3959
▁respon	-3960
xy	-3961
ses	-3962
pted	-3963
uses	-3964
▁Dra	-3965
house	-3966
▁1000.	-3967
▁Count	-3968
▁pages	-3969
▁songs	-3970
▁govern	-3971
▁classes	-3972
▁soldier	-3973
▁disappear	-3974
▁objective	-3975
▁participate	-3976
68	-3977
NN	-3978
(2,	-3979
▁77	-3980
ball	-3981
roll	-3982
▁50.	-3983
▁camp	-3984
▁belie	-3985
▁clock	-3986
▁floors	-3987
▁waiting	-3988
▁depending	-3989
▁locations	-3990
▁dictionary	-3991
aaa	-3992
ris	-3993
▁Rom	-3994
▁cry	-3995
ffici	-3996
▁autom	-3997
ulation	-3998
▁twenty	-3999
▁labeled	-4000
▁remembers	-4001
++++	-4002
▁NOT	-4003
▁imp	-4004
ission	-4005
▁objects	-4006
▁walking	-4007
▁existing	-4008
▁property	-4009
▁destroyed	-4010
▁generated	-4011
▁triangles	-4012
▁properties	-4013
▁scientists	-4014
1,1	-4015
▁je	-4016
▁dro	-4017
abbit	-4018
cdots	-4019
point	-4020
pping	-4021
teger	-4022
▁-100	-4023
▁push	-4024
▁says	-4025
▁shoot	-4026
▁finished	-4027
▁matching	-4028
▁computers	-4029
▁displayed	-4030
ups	-4031
▁$$	-4032
▁Ph	-4033
▁□□	-4034
uits	-4035
▁See	-4036
valid	-4037
▁Ciel	-4038
▁Pyth	-4039
▁warri	-4040
▁Answer	-4041
▁escape	-4042
▁precise	-4043
▁samples	-4044
▁presents	-4045
▁intervals	-4046
iro	-4047
▁-9	-4048
▁41	-4049
chan	-4050
ours	-4051
▁5),	-4052
▁Gen	-4053
▁life	-4054
▁past	-4055
▁save	-4056
▁100),	-4057
▁simply	-4058
▁buttons	-4059
▁parking	-4060
▁records	-4061
▁univers	-4062
▁actually	-4063
▁vertexes	-4064
▁buildings	-4065
▁customers	-4066
▁chocolates	-4067
▁performance	-4068
0000000000000000	-4069
IT	-4070
1,2	-4071
▁39	-4072
▁BB	-4073
2,3,	-4074
ream	-4075
▁10)	-4076
▁boys	-4077
number	-4078
▁repeat	-4079
▁travers	-4080
▁parenthes	-4081
▁combinations	-4082
▁(5	-4083
▁-7	-4084
▁52	-4085
▁:=	-4086
host	-4087
▁1.0	-4088
▁Gre	-4089
▁tra	-4090
▁adds	-4091
▁users	-4092
##.	-4093
book	-4094
▁ass	-4095
▁dots	-4096
▁erase	-4097
▁often	-4098
▁tunne	-4099
▁almost	-4100
▁consum	-4101
ibonacci	-4102
▁control	-4103
▁meeting	-4104
▁neither	-4105
▁organiz	-4106
▁diagonal	-4107
▁exceeding	-4108
▁infinitely	-4109
31	-4110
=1,	-4111
ook	-4112
▁Om	-4113
▁capt	-4114
▁serv	-4115
▁ware	-4116
▁bored	-4117
▁faces	-4118
▁domino	-4119
▁randomly	-4120
▁Constraint	-4121
▁blackboard	-4122
▁experiment	-4123
ky	-4124
ora	-4125
▁"2	-4126
▁Bi	-4127
▁clim	-4128
▁109),	-4129
▁judge	-4130
▁pupil	-4131
ference	-4132
viously	-4133
▁yellow	-4134
▁deleted	-4135
▁further	-4136
▁contests	-4137
▁mentioned	-4138
59	-4139
▁-6	-4140
----	-4141
▁12.	-4142
▁din	-4143
▁Vlad	-4144
▁arrive	-4145
▁giving	-4146
▁symmet	-4147
########	-4148
▁returns	-4149
▁selects	-4150
▁various	-4151
▁village	-4152
▁passenger	-4153
ew	-4154
tr	-4155
hab	-4156
oki	-4157
orm	-4158
you	-4159
▁('	-4160
▁2·	-4161
▁46	-4162
▁51	-4163
iter	-4164
▁\\\	-4165
▁abb	-4166
gredi	-4167
▁flag	-4168
▁runs	-4169
selves	-4170
▁Inter	-4171
▁Because	-4172
▁Besides	-4173
▁citizens	-4174
▁subarrays	-4175
▁combination	-4176
yes	-4177
▁"?	-4178
▁38	-4179
▁ju	-4180
▁Fig	-4181
▁dem	-4182
▁unl	-4183
▁copy	-4184
▁hits	-4185
▁seen	-4186
reased	-4187
▁impro	-4188
▁smart	-4189
▁facing	-4190
▁rubles	-4191
▁ingredi	-4192
▁verdict	-4193
▁prepared	-4194
▁variants	-4195
27	-4196
3]	-4197
49	-4198
□□	-4199
leg	-4200
1000	-4201
igit	-4202
▁180	-4203
elebr	-4204
▁Aizu	-4205
▁fish	-4206
▁pipe	-4207
▁shelf	-4208
▁ending	-4209
▁powers	-4210
▁instant	-4211
▁looking	-4212
▁duration	-4213
▁performs	-4214
▁parameter	-4215
▁independently	-4216
▁intersections	-4217
▁Anton	-4218
▁guest	-4219
▁......	-4220
▁diamet	-4221
▁complex	-4222
▁conduct	-4223
▁incorrect	-4224
▁presented	-4225
tle	-4226
▁2⋅	-4227
oons	-4228
reets	-4229
